# Import libraries

In [1]:
import os
import pandas as pd

# Trade by country

## Trade invoice percent by currency

In [79]:
# Load raw data on percent of trade invoiced by currency and country
df_trade = pd.read_excel('imf_trade_invoice_currencies.xlsx')
df_trade

,country,ISO3C,imfcode,year,flow,USD,EUR,Home,Other,Unclassified,Other_Excl_USDEUR
0,Albania,ALB,914,2010,Export,23.060534,75.265861,0.000000,1.673605,0.0,1.673605
1,Albania,ALB,914,2010,Import,23.992825,74.330016,0.000000,1.677159,0.0,1.677159
2,Albania,ALB,914,2011,Export,27.848475,69.763815,0.000000,2.387711,0.0,2.387711
3,Albania,ALB,914,2011,Import,26.581114,71.371327,0.000000,2.047559,0.0,2.047559
4,Albania,ALB,914,2012,Export,28.613207,68.094954,0.000000,3.291839,0.0,3.291839
...,...,...,...,...,...,...,...,...,...,...,...
2602,Uruguay,URY,298,2019,Import,59.554197,3.286332,26.081748,11.077723,0.0,37.159470
2603,Uzbekistan,UZB,927,2018,Export,97.000000,3.000000,NaN,NaN,0.0,0.000000
2604,Uzbekistan,UZB,927,2018,Import,85.000000,11.000000,NaN,NaN,0.0,4.000000
2605,Uzbekistan,UZB,927,2019,Export,96.000000,3.000000,NaN,NaN,0.0,1.000000
2606,Uzbekistan,UZB,927,2019,Import,81.000000,14.000000,NaN,NaN,0.0,5.000000

In [81]:
df_trade.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2607 entries, 0 to 2606
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   country            2607 non-null   object
 1   ISO3C              2607 non-null   object
 2   imfcode            2607 non-null   int64
 3   year               2607 non-null   int64
 4   flow               2607 non-null   object
 5   USD                2579 non-null   float64
 6   EUR                2529 non-null   float64
 7   Home               1893 non-null   float64
 8   Other              2108 non-null   float64
 9   Unclassified       2607 non-null   float64
 10  Other_Excl_USDEUR  2502 non-null   float64
dtypes: float64(6), int64(2), object(3)
memory usage: 224.2+ KB

In [83]:
# Remove unnecessary columns
df_trade = df_trade.drop(columns = ['imfcode', 'EUR', 'Home', 'Other', 'Unclassified', 'Other_Excl_USDEUR'])

# Rename columns using standardized format
new_trade_columns = {'ISO3C': 'country_code',
                     'USD': 'pct_usd'}

df_trade = df_trade.rename(mapper = new_trade_columns, axis = 1)

# Reorder the columns
df_trade = df_trade.reindex(columns = ['year', 'country', 'country_code', 'flow', 'pct_usd'])

# Express percent as decimals
df_trade['pct_usd'] = df_trade['pct_usd'] / 100

# Change 'year' format from integer to datetime
df_trade['year'] = pd.to_datetime(arg = df_trade['year'], format = '%Y')

In [85]:
df_trade

           year     country country_code    flow   pct_usd
0    2010-01-01     Albania          ALB  Export  0.230605
1    2010-01-01     Albania          ALB  Import  0.239928
2    2011-01-01     Albania          ALB  Export  0.278485
3    2011-01-01     Albania          ALB  Import  0.265811
4    2012-01-01     Albania          ALB  Export  0.286132
...         ...         ...          ...     ...       ...
2602 2019-01-01     Uruguay          URY  Import  0.595542
2603 2018-01-01  Uzbekistan          UZB  Export  0.970000
2604 2018-01-01  Uzbekistan          UZB  Import  0.850000
2605 2019-01-01  Uzbekistan          UZB  Export  0.960000
2606 2019-01-01  Uzbekistan          UZB  Import  0.810000

[2607 rows x 5 columns]

In [87]:
# Inspect data post-transformation
df_trade.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2607 entries, 0 to 2606
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          2607 non-null   datetime64[ns]
 1   country       2607 non-null   object
 2   country_code  2607 non-null   object
 3   flow          2607 non-null   object
 4   pct_usd       2579 non-null   float64
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 102.0+ KB

In [89]:
# Check for duplicates
df_trade[df_trade.duplicated()]

Empty DataFrame
Columns: [year, country, country_code, flow, pct_usd]
Index: []

In [91]:
# Check for missing vlaues
df_trade[df_trade.isna().any(axis = 1)]

           year        country country_code    flow  pct_usd
112  2007-01-01        Austria          AUT  Import      NaN
195  2000-01-01        Belgium          BEL  Export      NaN
196  2000-01-01        Belgium          BEL  Import      NaN
197  2001-01-01        Belgium          BEL  Export      NaN
198  2001-01-01        Belgium          BEL  Import      NaN
1398 2000-01-01     Luxembourg          LUX  Export      NaN
1399 2000-01-01     Luxembourg          LUX  Import      NaN
1400 2001-01-01     Luxembourg          LUX  Export      NaN
1401 2001-01-01     Luxembourg          LUX  Import      NaN
1661 2003-01-01        Morocco          MAR  Import      NaN
2107 2002-01-01       Slovenia          SVN  Export      NaN
2108 2002-01-01       Slovenia          SVN  Import      NaN
2414 1995-01-01        Tunisia          TUN  Export      NaN
2415 1995-01-01        Tunisia          TUN  Import      NaN
2416 1996-01-01        Tunisia          TUN  Export      NaN
2417 1996-01-01        Tunisia          TUN  Import      NaN
2418 1997-01-01        Tunisia          TUN  Export      NaN
2419 1997-01-01        Tunisia          TUN  Import      NaN
2420 1998-01-01        Tunisia          TUN  Export      NaN
2421 1998-01-01        Tunisia          TUN  Import      NaN
2422 1999-01-01        Tunisia          TUN  Export      NaN
2423 1999-01-01        Tunisia          TUN  Import      NaN
2424 2000-01-01        Tunisia          TUN  Export      NaN
2425 2000-01-01        Tunisia          TUN  Import      NaN
2426 2001-01-01        Tunisia          TUN  Export      NaN
2427 2001-01-01        Tunisia          TUN  Import      NaN
2446 2019-01-01        Tunisia          TUN  Export      NaN
2561 2003-01-01  United States          USA  Export      NaN

In [93]:
# Count number of rows with missing values
len(df_trade[df_trade.isna().any(axis = 1)])

28

In [95]:
# Remove rows with null values under 'pct_usd' column
df_trade = df_trade[df_trade.isna().any(axis = 1) == False]
df_trade

           year     country country_code    flow   pct_usd
0    2010-01-01     Albania          ALB  Export  0.230605
1    2010-01-01     Albania          ALB  Import  0.239928
2    2011-01-01     Albania          ALB  Export  0.278485
3    2011-01-01     Albania          ALB  Import  0.265811
4    2012-01-01     Albania          ALB  Export  0.286132
...         ...         ...          ...     ...       ...
2602 2019-01-01     Uruguay          URY  Import  0.595542
2603 2018-01-01  Uzbekistan          UZB  Export  0.970000
2604 2018-01-01  Uzbekistan          UZB  Import  0.850000
2605 2019-01-01  Uzbekistan          UZB  Export  0.960000
2606 2019-01-01  Uzbekistan          UZB  Import  0.810000

[2579 rows x 5 columns]

In [97]:
# Number of unique countries
df_trade['country'].nunique()

110

In [99]:
# Range of years
df_trade['year'].describe()

count                             2579
mean     2010-03-31 22:47:24.823575040
min                1989-01-01 00:00:00
25%                2005-01-01 00:00:00
50%                2012-01-01 00:00:00
75%                2016-01-01 00:00:00
max                2019-01-01 00:00:00
Name: year, dtype: object

In [101]:
df_trade.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2579 entries, 0 to 2606
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          2579 non-null   datetime64[ns]
 1   country       2579 non-null   object
 2   country_code  2579 non-null   object
 3   flow          2579 non-null   object
 4   pct_usd       2579 non-null   float64
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 120.9+ KB

In [147]:
# Comment out after creating CSV file
## Save dollar share of trade table as a CSV file
### df_trade.to_csv(path_or_buf = './silver_data/imf_trade_dollar_share.csv', index = False)

## Trade values

In [103]:
# Load raw data on dollar amount of trade by country
df_trade_value = pd.read_csv(filepath_or_buffer = 'wb_trade_values.csv', 
                             engine = 'python', 
                             skipfooter = 5)
df_trade_value

,Series Name,Series Code,Country Name,Country Code,Time,Time Code,Value
0,Exports of goods and services (current US$),NE.EXP.GNFS.CD,Afghanistan,AFG,1989.0,YR1989,..
1,Exports of goods and services (current US$),NE.EXP.GNFS.CD,Afghanistan,AFG,1990.0,YR1990,..
2,Exports of goods and services (current US$),NE.EXP.GNFS.CD,Afghanistan,AFG,1991.0,YR1991,..
3,Exports of goods and services (current US$),NE.EXP.GNFS.CD,Afghanistan,AFG,1992.0,YR1992,..
4,Exports of goods and services (current US$),NE.EXP.GNFS.CD,Afghanistan,AFG,1993.0,YR1993,..
...,...,...,...,...,...,...,...
15614,Imports of goods and services (current US$),NE.IMP.GNFS.CD,Zimbabwe,ZWE,2015.0,YR2015,7503919249.22327
15615,Imports of goods and services (current US$),NE.IMP.GNFS.CD,Zimbabwe,ZWE,2016.0,YR2016,6426719159.86889
15616,Imports of goods and services (current US$),NE.IMP.GNFS.CD,Zimbabwe,ZWE,2017.0,YR2017,15511466938.8536
15617,Imports of goods and services (current US$),NE.IMP.GNFS.CD,Zimbabwe,ZWE,2018.0,YR2018,9695629114.32537
15618,Imports of goods and services (current US$),NE.IMP.GNFS.CD,Zimbabwe,ZWE,2019.0,YR2019,7262568140.5209

In [105]:
# Remove unnecessary columns
df_trade_value = df_trade_value.drop(columns = ['Series Code', 'Time Code'])

# Rename columns using standardized foramt
new_trade_value_columns = {'Series Name': 'flow',
                           'Country Name': 'country',
                           'Country Code': 'country_code',
                           'Time': 'year',
                           'Value': 'value_usd'
                          }

df_trade_value = df_trade_value.rename(mapper = new_trade_value_columns, axis = 1)

# Reorder columns
df_trade_value = df_trade_value.reindex(columns = ['year', 'country', 'country_code', 'flow', 'value_usd'])

# Simplify string values for 'flow' column
new_flow_name = {'Exports of goods and services (current US$)': 'Export',
                 'Imports of goods and services (current US$)': 'Import'
                }

df_trade_value['flow'] = df_trade_value['flow'].replace(to_replace = new_flow_name)

# Convert column 'value_usd' to number format
df_trade_value['value_usd'] = pd.to_numeric(arg = df_trade_value['value_usd'], errors = 'coerce')

# Convert column 'year' to date-time format
df_trade_value['year'] = pd.to_datetime(arg = df_trade_value['year'], format = '%Y')

In [107]:
df_trade_value

            year      country country_code    flow     value_usd
0     1989-01-01  Afghanistan          AFG  Export           NaN
1     1990-01-01  Afghanistan          AFG  Export           NaN
2     1991-01-01  Afghanistan          AFG  Export           NaN
3     1992-01-01  Afghanistan          AFG  Export           NaN
4     1993-01-01  Afghanistan          AFG  Export           NaN
...          ...          ...          ...     ...           ...
15614 2015-01-01     Zimbabwe          ZWE  Import  7.503919e+09
15615 2016-01-01     Zimbabwe          ZWE  Import  6.426719e+09
15616 2017-01-01     Zimbabwe          ZWE  Import  1.551147e+10
15617 2018-01-01     Zimbabwe          ZWE  Import  9.695629e+09
15618 2019-01-01     Zimbabwe          ZWE  Import  7.262568e+09

[15619 rows x 5 columns]

In [109]:
# Check for duplicates
df_trade_value[df_trade_value.duplicated()]

Empty DataFrame
Columns: [year, country, country_code, flow, value_usd]
Index: []

In [139]:
# Check for null values
df_trade_value[df_trade_value['value_usd'].isna()]

            year      country country_code    flow  value_usd
0     1989-01-01  Afghanistan          AFG  Export        NaN
1     1990-01-01  Afghanistan          AFG  Export        NaN
2     1991-01-01  Afghanistan          AFG  Export        NaN
3     1992-01-01  Afghanistan          AFG  Export        NaN
4     1993-01-01  Afghanistan          AFG  Export        NaN
...          ...          ...          ...     ...        ...
15553 1990-01-01       Zambia          ZMB  Import        NaN
15554 1991-01-01       Zambia          ZMB  Import        NaN
15555 1992-01-01       Zambia          ZMB  Import        NaN
15556 1993-01-01       Zambia          ZMB  Import        NaN
15587 2024-01-01       Zambia          ZMB  Import        NaN

[3392 rows x 5 columns]

In [141]:
# Drop rows with null values
df_trade_value = df_trade_value.dropna(how = 'any', ignore_index = True)
df_trade_value

            year      country country_code    flow     value_usd
0     2020-01-01  Afghanistan          AFG  Export  2.079571e+09
1     2021-01-01  Afghanistan          AFG  Export  2.045190e+09
2     2022-01-01  Afghanistan          AFG  Export  2.664600e+09
3     2023-01-01  Afghanistan          AFG  Export  2.890630e+09
4     1989-01-01      Albania          ALB  Export  4.189250e+08
...          ...          ...          ...     ...           ...
12222 2015-01-01     Zimbabwe          ZWE  Import  7.503919e+09
12223 2016-01-01     Zimbabwe          ZWE  Import  6.426719e+09
12224 2017-01-01     Zimbabwe          ZWE  Import  1.551147e+10
12225 2018-01-01     Zimbabwe          ZWE  Import  9.695629e+09
12226 2019-01-01     Zimbabwe          ZWE  Import  7.262568e+09

[12227 rows x 5 columns]

In [143]:
df_trade_value.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12227 entries, 0 to 12226
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          12227 non-null  datetime64[ns]
 1   country       12227 non-null  object
 2   country_code  12227 non-null  object
 3   flow          12227 non-null  object
 4   value_usd     12227 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 477.7+ KB

In [145]:
# Number of unique countries
df_trade_value['country'].nunique()

193

In [149]:
# Comment out after creating CSV file
## Save dollar share of trade table as a CSV file
### df_trade_value.to_csv(path_or_buf = './silver_data/wb_trade_values_clean.csv', index = False)

# Balance of payments

In [3]:
df_bop = pd.read_csv('imf_bop.csv')
df_bop

,COUNTRY,INDICATOR,UNIT,FREQUENCY,TIME_PERIOD,OBS_VALUE
0,United States,Capital account balance (credit less debit),US dollar,Annual,1970,0.000000e+00
1,United States,Capital account balance (credit less debit),US dollar,Annual,1971,0.000000e+00
2,United States,Capital account balance (credit less debit),US dollar,Annual,1972,0.000000e+00
3,United States,Capital account balance (credit less debit),US dollar,Annual,1973,0.000000e+00
4,United States,Capital account balance (credit less debit),US dollar,Annual,1974,0.000000e+00
...,...,...,...,...,...,...
215,United States,Current account balance (credit less debit),US dollar,Annual,2020,-5.935040e+11
216,United States,Current account balance (credit less debit),US dollar,Annual,2021,-8.586340e+11
217,United States,Current account balance (credit less debit),US dollar,Annual,2022,-9.931420e+11
218,United States,Current account balance (credit less debit),US dollar,Annual,2023,-9.280170e+11
219,United States,Current account balance (credit less debit),US dollar,Annual,2024,-1.185294e+12

In [5]:
df_bop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 220 entries, 0 to 219
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   COUNTRY      220 non-null    object
 1   INDICATOR    220 non-null    object
 2   UNIT         220 non-null    object
 3   FREQUENCY    220 non-null    object
 4   TIME_PERIOD  220 non-null    int64
 5   OBS_VALUE    220 non-null    float64
dtypes: float64(1), int64(1), object(4)
memory usage: 10.4+ KB

In [7]:
# Remove NaN country values
df_bop_us = df_bop[df_bop['COUNTRY'] == 'United States']
df_bop_us

,COUNTRY,INDICATOR,UNIT,FREQUENCY,TIME_PERIOD,OBS_VALUE
0,United States,Capital account balance (credit less debit),US dollar,Annual,1970,0.000000e+00
1,United States,Capital account balance (credit less debit),US dollar,Annual,1971,0.000000e+00
2,United States,Capital account balance (credit less debit),US dollar,Annual,1972,0.000000e+00
3,United States,Capital account balance (credit less debit),US dollar,Annual,1973,0.000000e+00
4,United States,Capital account balance (credit less debit),US dollar,Annual,1974,0.000000e+00
...,...,...,...,...,...,...
215,United States,Current account balance (credit less debit),US dollar,Annual,2020,-5.935040e+11
216,United States,Current account balance (credit less debit),US dollar,Annual,2021,-8.586340e+11
217,United States,Current account balance (credit less debit),US dollar,Annual,2022,-9.931420e+11
218,United States,Current account balance (credit less debit),US dollar,Annual,2023,-9.280170e+11
219,United States,Current account balance (credit less debit),US dollar,Annual,2024,-1.185294e+12

In [9]:
df_bop_us.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 220 entries, 0 to 219
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   COUNTRY      220 non-null    object
 1   INDICATOR    220 non-null    object
 2   UNIT         220 non-null    object
 3   FREQUENCY    220 non-null    object
 4   TIME_PERIOD  220 non-null    int64
 5   OBS_VALUE    220 non-null    float64
dtypes: float64(1), int64(1), object(4)
memory usage: 10.4+ KB

In [11]:
# Check there's no missing country value
df_bop_us['COUNTRY'].unique()

array(['United States'], dtype=object)

In [13]:
# Check bop components
df_bop_us['INDICATOR'].unique()

array(['Capital account balance (credit less debit)',
       'Financial account balance (assets less liabilities), Adjusted using IMF accounting records',
       'Net errors and omissions, Adjusted using IMF accounting records',
       'Current account balance (credit less debit)'], dtype=object)

In [15]:
# Check year range
df_bop_us['TIME_PERIOD'].describe()

count     220.00000
mean     1997.00000
std        15.91071
min      1970.00000
25%      1983.00000
50%      1997.00000
75%      2011.00000
max      2024.00000
Name: TIME_PERIOD, dtype: float64

In [17]:
# Check obs_value
df_bop_us['OBS_VALUE'].describe()

count    2.200000e+02
mean    -1.456273e+11
std      2.635503e+11
min     -1.185294e+12
25%     -1.624355e+11
50%     -7.716135e+09
75%      0.000000e+00
max      1.480393e+11
Name: OBS_VALUE, dtype: float64

In [19]:
df_bop_us.columns

Index(['COUNTRY', 'INDICATOR', 'UNIT', 'FREQUENCY', 'TIME_PERIOD',
       'OBS_VALUE'],
      dtype='object')

In [21]:
# Drop unnecessary columns
df_bop_us = df_bop_us.drop(columns = ['UNIT', 'FREQUENCY'])
df_bop_us

,COUNTRY,INDICATOR,TIME_PERIOD,OBS_VALUE
0,United States,Capital account balance (credit less debit),1970,0.000000e+00
1,United States,Capital account balance (credit less debit),1971,0.000000e+00
2,United States,Capital account balance (credit less debit),1972,0.000000e+00
3,United States,Capital account balance (credit less debit),1973,0.000000e+00
4,United States,Capital account balance (credit less debit),1974,0.000000e+00
...,...,...,...,...
215,United States,Current account balance (credit less debit),2020,-5.935040e+11
216,United States,Current account balance (credit less debit),2021,-8.586340e+11
217,United States,Current account balance (credit less debit),2022,-9.931420e+11
218,United States,Current account balance (credit less debit),2023,-9.280170e+11
219,United States,Current account balance (credit less debit),2024,-1.185294e+12

In [23]:
# Reorder columns
df_bop_us = df_bop_us.reindex(columns = ['TIME_PERIOD', 'COUNTRY', 'INDICATOR', 'OBS_VALUE'])
df_bop_us

,TIME_PERIOD,COUNTRY,INDICATOR,OBS_VALUE
0,1970,United States,Capital account balance (credit less debit),0.000000e+00
1,1971,United States,Capital account balance (credit less debit),0.000000e+00
2,1972,United States,Capital account balance (credit less debit),0.000000e+00
3,1973,United States,Capital account balance (credit less debit),0.000000e+00
4,1974,United States,Capital account balance (credit less debit),0.000000e+00
...,...,...,...,...
215,2020,United States,Current account balance (credit less debit),-5.935040e+11
216,2021,United States,Current account balance (credit less debit),-8.586340e+11
217,2022,United States,Current account balance (credit less debit),-9.931420e+11
218,2023,United States,Current account balance (credit less debit),-9.280170e+11
219,2024,United States,Current account balance (credit less debit),-1.185294e+12

In [25]:
# Change column names and format
new_bop_columns = {'TIME_PERIOD': 'year',
                   'COUNTRY': 'country',
                   'INDICATOR': 'bop_account',
                   'OBS_VALUE': 'value_usd'
                  }

df_bop_us = df_bop_us.rename(mapper = new_bop_columns, axis = 1)
df_bop_us

,year,country,bop_account,value_usd
0,1970,United States,Capital account balance (credit less debit),0.000000e+00
1,1971,United States,Capital account balance (credit less debit),0.000000e+00
2,1972,United States,Capital account balance (credit less debit),0.000000e+00
3,1973,United States,Capital account balance (credit less debit),0.000000e+00
4,1974,United States,Capital account balance (credit less debit),0.000000e+00
...,...,...,...,...
215,2020,United States,Current account balance (credit less debit),-5.935040e+11
216,2021,United States,Current account balance (credit less debit),-8.586340e+11
217,2022,United States,Current account balance (credit less debit),-9.931420e+11
218,2023,United States,Current account balance (credit less debit),-9.280170e+11
219,2024,United States,Current account balance (credit less debit),-1.185294e+12

In [27]:
# Turn 'year' column to datetime
df_bop_us['year'] = pd.to_datetime(arg = df_bop_us['year'], format = '%Y')
df_bop_us

,year,country,bop_account,value_usd
0,1970-01-01,United States,Capital account balance (credit less debit),0.000000e+00
1,1971-01-01,United States,Capital account balance (credit less debit),0.000000e+00
2,1972-01-01,United States,Capital account balance (credit less debit),0.000000e+00
3,1973-01-01,United States,Capital account balance (credit less debit),0.000000e+00
4,1974-01-01,United States,Capital account balance (credit less debit),0.000000e+00
...,...,...,...,...
215,2020-01-01,United States,Current account balance (credit less debit),-5.935040e+11
216,2021-01-01,United States,Current account balance (credit less debit),-8.586340e+11
217,2022-01-01,United States,Current account balance (credit less debit),-9.931420e+11
218,2023-01-01,United States,Current account balance (credit less debit),-9.280170e+11
219,2024-01-01,United States,Current account balance (credit less debit),-1.185294e+12

In [33]:
# Simplify 'bop_account' column values
bop_mapper = {'Capital account balance (credit less debit)': 'Capital account',
              'Financial account balance (assets less liabilities), Adjusted using IMF accounting records': 'Financial account',
              'Net errors and omissions, Adjusted using IMF accounting records': 'Net errors and omissions',
              'Current account balance (credit less debit)': 'Current account'}

df_bop_us['bop_account'] = df_bop_us['bop_account'].replace(bop_mapper)

df_bop_us

          year        country      bop_account     value_usd
0   1970-01-01  United States  Capital account  0.000000e+00
1   1971-01-01  United States  Capital account  0.000000e+00
2   1972-01-01  United States  Capital account  0.000000e+00
3   1973-01-01  United States  Capital account  0.000000e+00
4   1974-01-01  United States  Capital account  0.000000e+00
..         ...            ...              ...           ...
215 2020-01-01  United States  Current account -5.935040e+11
216 2021-01-01  United States  Current account -8.586340e+11
217 2022-01-01  United States  Current account -9.931420e+11
218 2023-01-01  United States  Current account -9.280170e+11
219 2024-01-01  United States  Current account -1.185294e+12

[220 rows x 4 columns]

In [39]:
# Check for duplicates
df_bop_us[df_bop_us.duplicated()]

Empty DataFrame
Columns: [year, country, bop_account, value_usd]
Index: []

In [41]:
# Check for null values
df_bop_us[df_bop_us.isna().any(axis = 1)]

Empty DataFrame
Columns: [year, country, bop_account, value_usd]
Index: []

In [35]:
df_bop_us.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 220 entries, 0 to 219
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   year         220 non-null    datetime64[ns]
 1   country      220 non-null    object
 2   bop_account  220 non-null    object
 3   value_usd    220 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 7.0+ KB

In [43]:
# Comment out after creating CSV file
## Save clean bop table as a CSV file
### df_bop_us.to_csv(path_or_buf = './silver_data/imf_bop_clean.csv', index = False)

# FX reserves

In [45]:
df_reserves = pd.read_csv('imf_reserves.csv')
df_reserves

,COUNTRY,INDICATOR,FXR_CURRENCY,TYPE_OF_TRANSFORMATION,TIME_PERIOD,OBS_VALUE
0,World,Allocated foreign exchange reserves,Claims in Canadian dollar,Nominal value,2012,8.675234e+10
1,World,Allocated foreign exchange reserves,Claims in Canadian dollar,Nominal value,2013,1.138015e+11
2,World,Allocated foreign exchange reserves,Claims in Canadian dollar,Nominal value,2014,1.190243e+11
3,World,Allocated foreign exchange reserves,Claims in Canadian dollar,Nominal value,2015,1.316087e+11
4,World,Allocated foreign exchange reserves,Claims in Canadian dollar,Nominal value,2016,1.631438e+11
...,...,...,...,...,...,...
176,World,Allocated foreign exchange reserves,Claims in Chinese yuan renminbi,Nominal value,2020,2.716017e+11
177,World,Allocated foreign exchange reserves,Claims in Chinese yuan renminbi,Nominal value,2021,3.372598e+11
178,World,Allocated foreign exchange reserves,Claims in Chinese yuan renminbi,Nominal value,2022,2.884203e+11
179,World,Allocated foreign exchange reserves,Claims in Chinese yuan renminbi,Nominal value,2023,2.621813e+11
180,World,Allocated foreign exchange reserves,Claims in Chinese yuan renminbi,Nominal value,2024,2.498908e+11

In [47]:
df_reserves.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   COUNTRY                 181 non-null    object
 1   INDICATOR               181 non-null    object
 2   FXR_CURRENCY            181 non-null    object
 3   TYPE_OF_TRANSFORMATION  181 non-null    object
 4   TIME_PERIOD             181 non-null    int64
 5   OBS_VALUE               181 non-null    float64
dtypes: float64(1), int64(1), object(4)
memory usage: 8.6+ KB

In [49]:
# Check there's no missing country value
df_reserves['COUNTRY'].unique()

array(['World'], dtype=object)

In [51]:
# Check unique reserve currencies
df_reserves['FXR_CURRENCY'].unique()

array(['Claims in Canadian dollar', 'Claims in Australian dollar',
       'Claims in Euro', 'Claims in Pound sterling',
       'Claims in Swiss franc', 'Claims in US dollar',
       'Claims in Japanese yen', 'Claims in Chinese yuan renminbi'],
      dtype=object)

In [53]:
# Check year
df_reserves['TIME_PERIOD'].describe()

count     181.000000
mean     2011.530387
std         8.532644
min      1995.000000
25%      2004.000000
50%      2013.000000
75%      2019.000000
max      2024.000000
Name: TIME_PERIOD, dtype: float64

In [55]:
# Check obs_value
df_reserves['OBS_VALUE'].describe()

count    1.810000e+02
mean     9.077570e+11
std      1.578426e+12
min      3.171865e+09
25%      8.793869e+10
50%      2.455345e+11
75%      8.476922e+11
max      7.085004e+12
Name: OBS_VALUE, dtype: float64

In [57]:
df_reserves.columns

Index(['COUNTRY', 'INDICATOR', 'FXR_CURRENCY', 'TYPE_OF_TRANSFORMATION',
       'TIME_PERIOD', 'OBS_VALUE'],
      dtype='object')

In [59]:
# Drop unnecessary columns
df_reserves = df_reserves.drop(columns = ['INDICATOR', 'TYPE_OF_TRANSFORMATION'])
df_reserves

    COUNTRY                     FXR_CURRENCY  TIME_PERIOD     OBS_VALUE
0     World        Claims in Canadian dollar         2012  8.675234e+10
1     World        Claims in Canadian dollar         2013  1.138015e+11
2     World        Claims in Canadian dollar         2014  1.190243e+11
3     World        Claims in Canadian dollar         2015  1.316087e+11
4     World        Claims in Canadian dollar         2016  1.631438e+11
..      ...                              ...          ...           ...
176   World  Claims in Chinese yuan renminbi         2020  2.716017e+11
177   World  Claims in Chinese yuan renminbi         2021  3.372598e+11
178   World  Claims in Chinese yuan renminbi         2022  2.884203e+11
179   World  Claims in Chinese yuan renminbi         2023  2.621813e+11
180   World  Claims in Chinese yuan renminbi         2024  2.498908e+11

[181 rows x 4 columns]

In [61]:
# Reorder columns
df_reserves = df_reserves.reindex(columns = ['TIME_PERIOD', 'COUNTRY', 'FXR_CURRENCY', 'OBS_VALUE'])
df_reserves

     TIME_PERIOD COUNTRY                     FXR_CURRENCY     OBS_VALUE
0           2012   World        Claims in Canadian dollar  8.675234e+10
1           2013   World        Claims in Canadian dollar  1.138015e+11
2           2014   World        Claims in Canadian dollar  1.190243e+11
3           2015   World        Claims in Canadian dollar  1.316087e+11
4           2016   World        Claims in Canadian dollar  1.631438e+11
..           ...     ...                              ...           ...
176         2020   World  Claims in Chinese yuan renminbi  2.716017e+11
177         2021   World  Claims in Chinese yuan renminbi  3.372598e+11
178         2022   World  Claims in Chinese yuan renminbi  2.884203e+11
179         2023   World  Claims in Chinese yuan renminbi  2.621813e+11
180         2024   World  Claims in Chinese yuan renminbi  2.498908e+11

[181 rows x 4 columns]

In [63]:
# Change column names
new_reserves_columns = {'TIME_PERIOD': 'year',
                        'COUNTRY': 'country',
                        'FXR_CURRENCY': 'currency',
                        'OBS_VALUE': 'value_usd'
                       }
    
df_reserves = df_reserves.rename(mapper = new_reserves_columns, axis = 1)
df_reserves

     year country                         currency     value_usd
0    2012   World        Claims in Canadian dollar  8.675234e+10
1    2013   World        Claims in Canadian dollar  1.138015e+11
2    2014   World        Claims in Canadian dollar  1.190243e+11
3    2015   World        Claims in Canadian dollar  1.316087e+11
4    2016   World        Claims in Canadian dollar  1.631438e+11
..    ...     ...                              ...           ...
176  2020   World  Claims in Chinese yuan renminbi  2.716017e+11
177  2021   World  Claims in Chinese yuan renminbi  3.372598e+11
178  2022   World  Claims in Chinese yuan renminbi  2.884203e+11
179  2023   World  Claims in Chinese yuan renminbi  2.621813e+11
180  2024   World  Claims in Chinese yuan renminbi  2.498908e+11

[181 rows x 4 columns]

In [65]:
# Turn 'year' into datetime
df_reserves['year'] = pd.to_datetime(arg = df_reserves['year'], format = '%Y')
df_reserves

          year country                         currency     value_usd
0   2012-01-01   World        Claims in Canadian dollar  8.675234e+10
1   2013-01-01   World        Claims in Canadian dollar  1.138015e+11
2   2014-01-01   World        Claims in Canadian dollar  1.190243e+11
3   2015-01-01   World        Claims in Canadian dollar  1.316087e+11
4   2016-01-01   World        Claims in Canadian dollar  1.631438e+11
..         ...     ...                              ...           ...
176 2020-01-01   World  Claims in Chinese yuan renminbi  2.716017e+11
177 2021-01-01   World  Claims in Chinese yuan renminbi  3.372598e+11
178 2022-01-01   World  Claims in Chinese yuan renminbi  2.884203e+11
179 2023-01-01   World  Claims in Chinese yuan renminbi  2.621813e+11
180 2024-01-01   World  Claims in Chinese yuan renminbi  2.498908e+11

[181 rows x 4 columns]

In [67]:
# Simplify 'currency' column values
fx_mapper = {'Claims in Canadian dollar': 'Canadian dollar', 
             'Claims in Australian dollar': 'Australian dollar',
             'Claims in Euro': 'Euro', 
             'Claims in Pound sterling': 'Pound sterling',
             'Claims in Swiss franc': 'Swiss franc', 
             'Claims in US dollar': 'US dollar',
             'Claims in Japanese yen': 'Japanese yen', 
             'Claims in Chinese yuan renminbi': 'Chinese yuan renminbi'}

df_reserves['currency'] = df_reserves['currency'].replace(fx_mapper)

df_reserves

          year country               currency     value_usd
0   2012-01-01   World        Canadian dollar  8.675234e+10
1   2013-01-01   World        Canadian dollar  1.138015e+11
2   2014-01-01   World        Canadian dollar  1.190243e+11
3   2015-01-01   World        Canadian dollar  1.316087e+11
4   2016-01-01   World        Canadian dollar  1.631438e+11
..         ...     ...                    ...           ...
176 2020-01-01   World  Chinese yuan renminbi  2.716017e+11
177 2021-01-01   World  Chinese yuan renminbi  3.372598e+11
178 2022-01-01   World  Chinese yuan renminbi  2.884203e+11
179 2023-01-01   World  Chinese yuan renminbi  2.621813e+11
180 2024-01-01   World  Chinese yuan renminbi  2.498908e+11

[181 rows x 4 columns]

In [75]:
# Check for duplicates
df_reserves[df_reserves.duplicated()]

Empty DataFrame
Columns: [year, country, currency, value_usd]
Index: []

In [69]:
df_reserves.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       181 non-null    datetime64[ns]
 1   country    181 non-null    object
 2   currency   181 non-null    object
 3   value_usd  181 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 5.8+ KB

In [77]:
# Comment out after creating CSV file
## Save clean fx reserves table as a CSV file
### df_reserves.to_csv(path_or_buf = './silver_data/imf_reserves_clean.csv', index = False)

# U.S. Treasuries

## Foreign

In [103]:
# Dollars in billions
df_foreign_treasuries = pd.read_csv('fred_foreign_treasuries.csv')
df_foreign_treasuries

   observation_date  FDHBFIN
0        1970-01-01     19.7
1        1971-01-01     46.0
2        1972-01-01     54.4
3        1973-01-01     54.7
4        1974-01-01     58.8
5        1975-01-01     66.5
6        1976-01-01     78.1
7        1977-01-01    109.6
8        1978-01-01    133.1
9        1979-01-01    119.0
10       1980-01-01    129.7
11       1981-01-01    136.6
12       1982-01-01    149.5
13       1983-01-01    166.3
14       1984-01-01    192.9
15       1985-01-01    224.8
16       1986-01-01    263.4
17       1987-01-01    299.7
18       1988-01-01    362.2
19       1989-01-01    426.1
20       1990-01-01    487.1
21       1991-01-01    520.9
22       1992-01-01    576.7
23       1993-01-01    650.3
24       1994-01-01    667.3
25       1995-01-01    835.2
26       1996-01-01   1102.1
27       1997-01-01   1241.6
28       1998-01-01   1278.7
29       1999-01-01   1268.7
30       2000-01-01   1015.2
31       2001-01-01   1040.1
32       2002-01-01   1235.6
33       2003-01-01   1523.1
34       2004-01-01   1849.3
35       2005-01-01   2034.0
36       2006-01-01   2103.1
37       2007-01-01   2353.2
38       2008-01-01   3077.2
39       2009-01-01   3685.1
40       2010-01-01   4435.6
41       2011-01-01   5006.9
42       2012-01-01   5573.8
43       2013-01-01   5792.6
44       2014-01-01   6157.7
45       2015-01-01   6144.2
46       2016-01-01   6002.8
47       2017-01-01   6211.3
48       2018-01-01   6270.1
49       2019-01-01   6844.2
50       2020-01-01   7070.7
51       2021-01-01   7740.4
52       2022-01-01   7194.7
53       2023-01-01   7940.0
54       2024-01-01   8619.6

In [105]:
df_foreign_treasuries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   observation_date  55 non-null     object
 1   FDHBFIN           55 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1012.0+ bytes

In [107]:
# Check values
df_foreign_treasuries.describe()

           FDHBFIN
count    55.000000
mean   2338.912727
std    2720.242540
min      19.700000
25%     179.600000
50%    1040.100000
75%    4721.250000
max    8619.600000

In [109]:
df_foreign_treasuries.columns

Index(['observation_date', 'FDHBFIN'], dtype='object')

In [111]:
# Rename columns using standardized format
new_foreign_columns = {'observation_date': 'year',
                       'FDHBFIN': 'value_usd'
                      }

df_foreign_treasuries = df_foreign_treasuries.rename(mapper = new_foreign_columns, axis = 1)

df_foreign_treasuries

          year  value_usd
0   1970-01-01       19.7
1   1971-01-01       46.0
2   1972-01-01       54.4
3   1973-01-01       54.7
4   1974-01-01       58.8
5   1975-01-01       66.5
6   1976-01-01       78.1
7   1977-01-01      109.6
8   1978-01-01      133.1
9   1979-01-01      119.0
10  1980-01-01      129.7
11  1981-01-01      136.6
12  1982-01-01      149.5
13  1983-01-01      166.3
14  1984-01-01      192.9
15  1985-01-01      224.8
16  1986-01-01      263.4
17  1987-01-01      299.7
18  1988-01-01      362.2
19  1989-01-01      426.1
20  1990-01-01      487.1
21  1991-01-01      520.9
22  1992-01-01      576.7
23  1993-01-01      650.3
24  1994-01-01      667.3
25  1995-01-01      835.2
26  1996-01-01     1102.1
27  1997-01-01     1241.6
28  1998-01-01     1278.7
29  1999-01-01     1268.7
30  2000-01-01     1015.2
31  2001-01-01     1040.1
32  2002-01-01     1235.6
33  2003-01-01     1523.1
34  2004-01-01     1849.3
35  2005-01-01     2034.0
36  2006-01-01     2103.1
37  2007-01-01     2353.2
38  2008-01-01     3077.2
39  2009-01-01     3685.1
40  2010-01-01     4435.6
41  2011-01-01     5006.9
42  2012-01-01     5573.8
43  2013-01-01     5792.6
44  2014-01-01     6157.7
45  2015-01-01     6144.2
46  2016-01-01     6002.8
47  2017-01-01     6211.3
48  2018-01-01     6270.1
49  2019-01-01     6844.2
50  2020-01-01     7070.7
51  2021-01-01     7740.4
52  2022-01-01     7194.7
53  2023-01-01     7940.0
54  2024-01-01     8619.6

In [113]:
# Add 'source' column to indicate 'foreign'
df_foreign_treasuries['source'] = 'Foreign'

df_foreign_treasuries

          year  value_usd   source
0   1970-01-01       19.7  Foreign
1   1971-01-01       46.0  Foreign
2   1972-01-01       54.4  Foreign
3   1973-01-01       54.7  Foreign
4   1974-01-01       58.8  Foreign
5   1975-01-01       66.5  Foreign
6   1976-01-01       78.1  Foreign
7   1977-01-01      109.6  Foreign
8   1978-01-01      133.1  Foreign
9   1979-01-01      119.0  Foreign
10  1980-01-01      129.7  Foreign
11  1981-01-01      136.6  Foreign
12  1982-01-01      149.5  Foreign
13  1983-01-01      166.3  Foreign
14  1984-01-01      192.9  Foreign
15  1985-01-01      224.8  Foreign
16  1986-01-01      263.4  Foreign
17  1987-01-01      299.7  Foreign
18  1988-01-01      362.2  Foreign
19  1989-01-01      426.1  Foreign
20  1990-01-01      487.1  Foreign
21  1991-01-01      520.9  Foreign
22  1992-01-01      576.7  Foreign
23  1993-01-01      650.3  Foreign
24  1994-01-01      667.3  Foreign
25  1995-01-01      835.2  Foreign
26  1996-01-01     1102.1  Foreign
27  1997-01-01     1241.6  Foreign
28  1998-01-01     1278.7  Foreign
29  1999-01-01     1268.7  Foreign
30  2000-01-01     1015.2  Foreign
31  2001-01-01     1040.1  Foreign
32  2002-01-01     1235.6  Foreign
33  2003-01-01     1523.1  Foreign
34  2004-01-01     1849.3  Foreign
35  2005-01-01     2034.0  Foreign
36  2006-01-01     2103.1  Foreign
37  2007-01-01     2353.2  Foreign
38  2008-01-01     3077.2  Foreign
39  2009-01-01     3685.1  Foreign
40  2010-01-01     4435.6  Foreign
41  2011-01-01     5006.9  Foreign
42  2012-01-01     5573.8  Foreign
43  2013-01-01     5792.6  Foreign
44  2014-01-01     6157.7  Foreign
45  2015-01-01     6144.2  Foreign
46  2016-01-01     6002.8  Foreign
47  2017-01-01     6211.3  Foreign
48  2018-01-01     6270.1  Foreign
49  2019-01-01     6844.2  Foreign
50  2020-01-01     7070.7  Foreign
51  2021-01-01     7740.4  Foreign
52  2022-01-01     7194.7  Foreign
53  2023-01-01     7940.0  Foreign
54  2024-01-01     8619.6  Foreign

In [115]:
# Reorder columns
df_foreign_treasuries = df_foreign_treasuries.reindex(columns = ['year', 'source', 'value_usd'])

df_foreign_treasuries

          year   source  value_usd
0   1970-01-01  Foreign       19.7
1   1971-01-01  Foreign       46.0
2   1972-01-01  Foreign       54.4
3   1973-01-01  Foreign       54.7
4   1974-01-01  Foreign       58.8
5   1975-01-01  Foreign       66.5
6   1976-01-01  Foreign       78.1
7   1977-01-01  Foreign      109.6
8   1978-01-01  Foreign      133.1
9   1979-01-01  Foreign      119.0
10  1980-01-01  Foreign      129.7
11  1981-01-01  Foreign      136.6
12  1982-01-01  Foreign      149.5
13  1983-01-01  Foreign      166.3
14  1984-01-01  Foreign      192.9
15  1985-01-01  Foreign      224.8
16  1986-01-01  Foreign      263.4
17  1987-01-01  Foreign      299.7
18  1988-01-01  Foreign      362.2
19  1989-01-01  Foreign      426.1
20  1990-01-01  Foreign      487.1
21  1991-01-01  Foreign      520.9
22  1992-01-01  Foreign      576.7
23  1993-01-01  Foreign      650.3
24  1994-01-01  Foreign      667.3
25  1995-01-01  Foreign      835.2
26  1996-01-01  Foreign     1102.1
27  1997-01-01  Foreign     1241.6
28  1998-01-01  Foreign     1278.7
29  1999-01-01  Foreign     1268.7
30  2000-01-01  Foreign     1015.2
31  2001-01-01  Foreign     1040.1
32  2002-01-01  Foreign     1235.6
33  2003-01-01  Foreign     1523.1
34  2004-01-01  Foreign     1849.3
35  2005-01-01  Foreign     2034.0
36  2006-01-01  Foreign     2103.1
37  2007-01-01  Foreign     2353.2
38  2008-01-01  Foreign     3077.2
39  2009-01-01  Foreign     3685.1
40  2010-01-01  Foreign     4435.6
41  2011-01-01  Foreign     5006.9
42  2012-01-01  Foreign     5573.8
43  2013-01-01  Foreign     5792.6
44  2014-01-01  Foreign     6157.7
45  2015-01-01  Foreign     6144.2
46  2016-01-01  Foreign     6002.8
47  2017-01-01  Foreign     6211.3
48  2018-01-01  Foreign     6270.1
49  2019-01-01  Foreign     6844.2
50  2020-01-01  Foreign     7070.7
51  2021-01-01  Foreign     7740.4
52  2022-01-01  Foreign     7194.7
53  2023-01-01  Foreign     7940.0
54  2024-01-01  Foreign     8619.6

In [117]:
# Convert 'year' column to date-time format
df_foreign_treasuries['year'] = pd.to_datetime(arg = df_foreign_treasuries['year'], yearfirst = True)

df_foreign_treasuries

         year   source  value_usd
0  1970-01-01  Foreign       19.7
1  1971-01-01  Foreign       46.0
2  1972-01-01  Foreign       54.4
3  1973-01-01  Foreign       54.7
4  1974-01-01  Foreign       58.8
5  1975-01-01  Foreign       66.5
6  1976-01-01  Foreign       78.1
7  1977-01-01  Foreign      109.6
8  1978-01-01  Foreign      133.1
9  1979-01-01  Foreign      119.0
10 1980-01-01  Foreign      129.7
11 1981-01-01  Foreign      136.6
12 1982-01-01  Foreign      149.5
13 1983-01-01  Foreign      166.3
14 1984-01-01  Foreign      192.9
15 1985-01-01  Foreign      224.8
16 1986-01-01  Foreign      263.4
17 1987-01-01  Foreign      299.7
18 1988-01-01  Foreign      362.2
19 1989-01-01  Foreign      426.1
20 1990-01-01  Foreign      487.1
21 1991-01-01  Foreign      520.9
22 1992-01-01  Foreign      576.7
23 1993-01-01  Foreign      650.3
24 1994-01-01  Foreign      667.3
25 1995-01-01  Foreign      835.2
26 1996-01-01  Foreign     1102.1
27 1997-01-01  Foreign     1241.6
28 1998-01-01  Foreign     1278.7
29 1999-01-01  Foreign     1268.7
30 2000-01-01  Foreign     1015.2
31 2001-01-01  Foreign     1040.1
32 2002-01-01  Foreign     1235.6
33 2003-01-01  Foreign     1523.1
34 2004-01-01  Foreign     1849.3
35 2005-01-01  Foreign     2034.0
36 2006-01-01  Foreign     2103.1
37 2007-01-01  Foreign     2353.2
38 2008-01-01  Foreign     3077.2
39 2009-01-01  Foreign     3685.1
40 2010-01-01  Foreign     4435.6
41 2011-01-01  Foreign     5006.9
42 2012-01-01  Foreign     5573.8
43 2013-01-01  Foreign     5792.6
44 2014-01-01  Foreign     6157.7
45 2015-01-01  Foreign     6144.2
46 2016-01-01  Foreign     6002.8
47 2017-01-01  Foreign     6211.3
48 2018-01-01  Foreign     6270.1
49 2019-01-01  Foreign     6844.2
50 2020-01-01  Foreign     7070.7
51 2021-01-01  Foreign     7740.4
52 2022-01-01  Foreign     7194.7
53 2023-01-01  Foreign     7940.0
54 2024-01-01  Foreign     8619.6

In [119]:
# Convert 'value_usd' column to full dollars
df_foreign_treasuries['value_usd'] = df_foreign_treasuries['value_usd'] * 1e9

In [121]:
df_foreign_treasuries

         year   source     value_usd
0  1970-01-01  Foreign  1.970000e+10
1  1971-01-01  Foreign  4.600000e+10
2  1972-01-01  Foreign  5.440000e+10
3  1973-01-01  Foreign  5.470000e+10
4  1974-01-01  Foreign  5.880000e+10
5  1975-01-01  Foreign  6.650000e+10
6  1976-01-01  Foreign  7.810000e+10
7  1977-01-01  Foreign  1.096000e+11
8  1978-01-01  Foreign  1.331000e+11
9  1979-01-01  Foreign  1.190000e+11
10 1980-01-01  Foreign  1.297000e+11
11 1981-01-01  Foreign  1.366000e+11
12 1982-01-01  Foreign  1.495000e+11
13 1983-01-01  Foreign  1.663000e+11
14 1984-01-01  Foreign  1.929000e+11
15 1985-01-01  Foreign  2.248000e+11
16 1986-01-01  Foreign  2.634000e+11
17 1987-01-01  Foreign  2.997000e+11
18 1988-01-01  Foreign  3.622000e+11
19 1989-01-01  Foreign  4.261000e+11
20 1990-01-01  Foreign  4.871000e+11
21 1991-01-01  Foreign  5.209000e+11
22 1992-01-01  Foreign  5.767000e+11
23 1993-01-01  Foreign  6.503000e+11
24 1994-01-01  Foreign  6.673000e+11
25 1995-01-01  Foreign  8.352000e+11
26 1996-01-01  Foreign  1.102100e+12
27 1997-01-01  Foreign  1.241600e+12
28 1998-01-01  Foreign  1.278700e+12
29 1999-01-01  Foreign  1.268700e+12
30 2000-01-01  Foreign  1.015200e+12
31 2001-01-01  Foreign  1.040100e+12
32 2002-01-01  Foreign  1.235600e+12
33 2003-01-01  Foreign  1.523100e+12
34 2004-01-01  Foreign  1.849300e+12
35 2005-01-01  Foreign  2.034000e+12
36 2006-01-01  Foreign  2.103100e+12
37 2007-01-01  Foreign  2.353200e+12
38 2008-01-01  Foreign  3.077200e+12
39 2009-01-01  Foreign  3.685100e+12
40 2010-01-01  Foreign  4.435600e+12
41 2011-01-01  Foreign  5.006900e+12
42 2012-01-01  Foreign  5.573800e+12
43 2013-01-01  Foreign  5.792600e+12
44 2014-01-01  Foreign  6.157700e+12
45 2015-01-01  Foreign  6.144200e+12
46 2016-01-01  Foreign  6.002800e+12
47 2017-01-01  Foreign  6.211300e+12
48 2018-01-01  Foreign  6.270100e+12
49 2019-01-01  Foreign  6.844200e+12
50 2020-01-01  Foreign  7.070700e+12
51 2021-01-01  Foreign  7.740400e+12
52 2022-01-01  Foreign  7.194700e+12
53 2023-01-01  Foreign  7.940000e+12
54 2024-01-01  Foreign  8.619600e+12

In [123]:
df_foreign_treasuries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       55 non-null     datetime64[ns]
 1   source     55 non-null     object
 2   value_usd  55 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 1.4+ KB

## Total

In [125]:
# Dollars in millions
df_treasuries = pd.read_csv('fred_total_treasuries.csv')

df_treasuries

   observation_date     GFDEBTN
0        1966-01-01    329319.0
1        1967-01-01    344663.0
2        1968-01-01    358029.0
3        1969-01-01    368226.0
4        1970-01-01    389158.0
5        1971-01-01    424131.0
6        1972-01-01    448473.0
7        1973-01-01    469073.0
8        1974-01-01    492664.0
9        1975-01-01    576649.0
10       1976-01-01    653543.0
11       1977-01-01    718943.0
12       1978-01-01    789207.0
13       1979-01-01    845116.0
14       1980-01-01    930210.0
15       1981-01-01   1028729.0
16       1982-01-01   1197074.0
17       1983-01-01   1410702.0
18       1984-01-01   1662966.0
19       1985-01-01   1945942.0
20       1986-01-01   2214835.0
21       1987-01-01   2431715.0
22       1988-01-01   2684392.0
23       1989-01-01   2952994.0
24       1990-01-01   3364820.0
25       1991-01-01   3801698.0
26       1992-01-01   4177009.0
27       1993-01-01   4535687.0
28       1994-01-01   4800150.0
29       1995-01-01   4988665.0
30       1996-01-01   5323172.0
31       1997-01-01   5502388.0
32       1998-01-01   5614217.0
33       1999-01-01   5776091.0
34       2000-01-01   5662216.0
35       2001-01-01   5943439.0
36       2002-01-01   6405707.0
37       2003-01-01   6997964.0
38       2004-01-01   7596143.0
39       2005-01-01   8170413.0
40       2006-01-01   8680224.0
41       2007-01-01   9229172.0
42       2008-01-01  10699805.0
43       2009-01-01  12311349.0
44       2010-01-01  14025215.0
45       2011-01-01  15222940.0
46       2012-01-01  16432730.0
47       2013-01-01  17156119.0
48       2014-01-01  18141444.0
49       2015-01-01  18922179.0
50       2016-01-01  19976827.0
51       2017-01-01  20492747.0
52       2018-01-01  21974096.0
53       2019-01-01  23201380.0
54       2020-01-01  27747798.0
55       2021-01-01  29617215.0
56       2022-01-01  31419689.0
57       2023-01-01  34001494.0
58       2024-01-01  36218605.0
59       2025-01-01         NaN

In [127]:
# Null value detected for 2025
df_treasuries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   observation_date  60 non-null     object
 1   GFDEBTN           59 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.1+ KB

In [129]:
df_treasuries.describe()

            GFDEBTN
count  5.900000e+01
mean   8.471145e+06
std    9.626561e+06
min    3.293190e+05
25%    9.794695e+05
50%    4.988665e+06
75%    1.316828e+07
max    3.621860e+07

In [131]:
# Drop 2025 null value
df_treasuries = df_treasuries.dropna()

df_treasuries

   observation_date     GFDEBTN
0        1966-01-01    329319.0
1        1967-01-01    344663.0
2        1968-01-01    358029.0
3        1969-01-01    368226.0
4        1970-01-01    389158.0
5        1971-01-01    424131.0
6        1972-01-01    448473.0
7        1973-01-01    469073.0
8        1974-01-01    492664.0
9        1975-01-01    576649.0
10       1976-01-01    653543.0
11       1977-01-01    718943.0
12       1978-01-01    789207.0
13       1979-01-01    845116.0
14       1980-01-01    930210.0
15       1981-01-01   1028729.0
16       1982-01-01   1197074.0
17       1983-01-01   1410702.0
18       1984-01-01   1662966.0
19       1985-01-01   1945942.0
20       1986-01-01   2214835.0
21       1987-01-01   2431715.0
22       1988-01-01   2684392.0
23       1989-01-01   2952994.0
24       1990-01-01   3364820.0
25       1991-01-01   3801698.0
26       1992-01-01   4177009.0
27       1993-01-01   4535687.0
28       1994-01-01   4800150.0
29       1995-01-01   4988665.0
30       1996-01-01   5323172.0
31       1997-01-01   5502388.0
32       1998-01-01   5614217.0
33       1999-01-01   5776091.0
34       2000-01-01   5662216.0
35       2001-01-01   5943439.0
36       2002-01-01   6405707.0
37       2003-01-01   6997964.0
38       2004-01-01   7596143.0
39       2005-01-01   8170413.0
40       2006-01-01   8680224.0
41       2007-01-01   9229172.0
42       2008-01-01  10699805.0
43       2009-01-01  12311349.0
44       2010-01-01  14025215.0
45       2011-01-01  15222940.0
46       2012-01-01  16432730.0
47       2013-01-01  17156119.0
48       2014-01-01  18141444.0
49       2015-01-01  18922179.0
50       2016-01-01  19976827.0
51       2017-01-01  20492747.0
52       2018-01-01  21974096.0
53       2019-01-01  23201380.0
54       2020-01-01  27747798.0
55       2021-01-01  29617215.0
56       2022-01-01  31419689.0
57       2023-01-01  34001494.0
58       2024-01-01  36218605.0

In [133]:
# Rename columns using standardized format
new_all_columns = {'observation_date': 'year',
                       'GFDEBTN': 'value_usd'
                      }

df_treasuries = df_treasuries.rename(mapper = new_all_columns, axis = 1)

df_treasuries

          year   value_usd
0   1966-01-01    329319.0
1   1967-01-01    344663.0
2   1968-01-01    358029.0
3   1969-01-01    368226.0
4   1970-01-01    389158.0
5   1971-01-01    424131.0
6   1972-01-01    448473.0
7   1973-01-01    469073.0
8   1974-01-01    492664.0
9   1975-01-01    576649.0
10  1976-01-01    653543.0
11  1977-01-01    718943.0
12  1978-01-01    789207.0
13  1979-01-01    845116.0
14  1980-01-01    930210.0
15  1981-01-01   1028729.0
16  1982-01-01   1197074.0
17  1983-01-01   1410702.0
18  1984-01-01   1662966.0
19  1985-01-01   1945942.0
20  1986-01-01   2214835.0
21  1987-01-01   2431715.0
22  1988-01-01   2684392.0
23  1989-01-01   2952994.0
24  1990-01-01   3364820.0
25  1991-01-01   3801698.0
26  1992-01-01   4177009.0
27  1993-01-01   4535687.0
28  1994-01-01   4800150.0
29  1995-01-01   4988665.0
30  1996-01-01   5323172.0
31  1997-01-01   5502388.0
32  1998-01-01   5614217.0
33  1999-01-01   5776091.0
34  2000-01-01   5662216.0
35  2001-01-01   5943439.0
36  2002-01-01   6405707.0
37  2003-01-01   6997964.0
38  2004-01-01   7596143.0
39  2005-01-01   8170413.0
40  2006-01-01   8680224.0
41  2007-01-01   9229172.0
42  2008-01-01  10699805.0
43  2009-01-01  12311349.0
44  2010-01-01  14025215.0
45  2011-01-01  15222940.0
46  2012-01-01  16432730.0
47  2013-01-01  17156119.0
48  2014-01-01  18141444.0
49  2015-01-01  18922179.0
50  2016-01-01  19976827.0
51  2017-01-01  20492747.0
52  2018-01-01  21974096.0
53  2019-01-01  23201380.0
54  2020-01-01  27747798.0
55  2021-01-01  29617215.0
56  2022-01-01  31419689.0
57  2023-01-01  34001494.0
58  2024-01-01  36218605.0

In [135]:
# Add 'source' column to indicate 'all'
df_treasuries['source'] = 'All'

df_treasuries

          year   value_usd source
0   1966-01-01    329319.0    All
1   1967-01-01    344663.0    All
2   1968-01-01    358029.0    All
3   1969-01-01    368226.0    All
4   1970-01-01    389158.0    All
5   1971-01-01    424131.0    All
6   1972-01-01    448473.0    All
7   1973-01-01    469073.0    All
8   1974-01-01    492664.0    All
9   1975-01-01    576649.0    All
10  1976-01-01    653543.0    All
11  1977-01-01    718943.0    All
12  1978-01-01    789207.0    All
13  1979-01-01    845116.0    All
14  1980-01-01    930210.0    All
15  1981-01-01   1028729.0    All
16  1982-01-01   1197074.0    All
17  1983-01-01   1410702.0    All
18  1984-01-01   1662966.0    All
19  1985-01-01   1945942.0    All
20  1986-01-01   2214835.0    All
21  1987-01-01   2431715.0    All
22  1988-01-01   2684392.0    All
23  1989-01-01   2952994.0    All
24  1990-01-01   3364820.0    All
25  1991-01-01   3801698.0    All
26  1992-01-01   4177009.0    All
27  1993-01-01   4535687.0    All
28  1994-01-01   4800150.0    All
29  1995-01-01   4988665.0    All
30  1996-01-01   5323172.0    All
31  1997-01-01   5502388.0    All
32  1998-01-01   5614217.0    All
33  1999-01-01   5776091.0    All
34  2000-01-01   5662216.0    All
35  2001-01-01   5943439.0    All
36  2002-01-01   6405707.0    All
37  2003-01-01   6997964.0    All
38  2004-01-01   7596143.0    All
39  2005-01-01   8170413.0    All
40  2006-01-01   8680224.0    All
41  2007-01-01   9229172.0    All
42  2008-01-01  10699805.0    All
43  2009-01-01  12311349.0    All
44  2010-01-01  14025215.0    All
45  2011-01-01  15222940.0    All
46  2012-01-01  16432730.0    All
47  2013-01-01  17156119.0    All
48  2014-01-01  18141444.0    All
49  2015-01-01  18922179.0    All
50  2016-01-01  19976827.0    All
51  2017-01-01  20492747.0    All
52  2018-01-01  21974096.0    All
53  2019-01-01  23201380.0    All
54  2020-01-01  27747798.0    All
55  2021-01-01  29617215.0    All
56  2022-01-01  31419689.0    All
57  2023-01-01  34001494.0    All
58  2024-01-01  36218605.0    All

In [137]:
# Reorder columns
df_treasuries = df_treasuries.reindex(columns = ['year', 'source', 'value_usd'])
df_treasuries

          year source   value_usd
0   1966-01-01    All    329319.0
1   1967-01-01    All    344663.0
2   1968-01-01    All    358029.0
3   1969-01-01    All    368226.0
4   1970-01-01    All    389158.0
5   1971-01-01    All    424131.0
6   1972-01-01    All    448473.0
7   1973-01-01    All    469073.0
8   1974-01-01    All    492664.0
9   1975-01-01    All    576649.0
10  1976-01-01    All    653543.0
11  1977-01-01    All    718943.0
12  1978-01-01    All    789207.0
13  1979-01-01    All    845116.0
14  1980-01-01    All    930210.0
15  1981-01-01    All   1028729.0
16  1982-01-01    All   1197074.0
17  1983-01-01    All   1410702.0
18  1984-01-01    All   1662966.0
19  1985-01-01    All   1945942.0
20  1986-01-01    All   2214835.0
21  1987-01-01    All   2431715.0
22  1988-01-01    All   2684392.0
23  1989-01-01    All   2952994.0
24  1990-01-01    All   3364820.0
25  1991-01-01    All   3801698.0
26  1992-01-01    All   4177009.0
27  1993-01-01    All   4535687.0
28  1994-01-01    All   4800150.0
29  1995-01-01    All   4988665.0
30  1996-01-01    All   5323172.0
31  1997-01-01    All   5502388.0
32  1998-01-01    All   5614217.0
33  1999-01-01    All   5776091.0
34  2000-01-01    All   5662216.0
35  2001-01-01    All   5943439.0
36  2002-01-01    All   6405707.0
37  2003-01-01    All   6997964.0
38  2004-01-01    All   7596143.0
39  2005-01-01    All   8170413.0
40  2006-01-01    All   8680224.0
41  2007-01-01    All   9229172.0
42  2008-01-01    All  10699805.0
43  2009-01-01    All  12311349.0
44  2010-01-01    All  14025215.0
45  2011-01-01    All  15222940.0
46  2012-01-01    All  16432730.0
47  2013-01-01    All  17156119.0
48  2014-01-01    All  18141444.0
49  2015-01-01    All  18922179.0
50  2016-01-01    All  19976827.0
51  2017-01-01    All  20492747.0
52  2018-01-01    All  21974096.0
53  2019-01-01    All  23201380.0
54  2020-01-01    All  27747798.0
55  2021-01-01    All  29617215.0
56  2022-01-01    All  31419689.0
57  2023-01-01    All  34001494.0
58  2024-01-01    All  36218605.0

In [139]:
# Convert 'year' column as date-time format
df_treasuries['year'] = pd.to_datetime(arg = df_treasuries['year'], yearfirst = True)

df_treasuries

         year source   value_usd
0  1966-01-01    All    329319.0
1  1967-01-01    All    344663.0
2  1968-01-01    All    358029.0
3  1969-01-01    All    368226.0
4  1970-01-01    All    389158.0
5  1971-01-01    All    424131.0
6  1972-01-01    All    448473.0
7  1973-01-01    All    469073.0
8  1974-01-01    All    492664.0
9  1975-01-01    All    576649.0
10 1976-01-01    All    653543.0
11 1977-01-01    All    718943.0
12 1978-01-01    All    789207.0
13 1979-01-01    All    845116.0
14 1980-01-01    All    930210.0
15 1981-01-01    All   1028729.0
16 1982-01-01    All   1197074.0
17 1983-01-01    All   1410702.0
18 1984-01-01    All   1662966.0
19 1985-01-01    All   1945942.0
20 1986-01-01    All   2214835.0
21 1987-01-01    All   2431715.0
22 1988-01-01    All   2684392.0
23 1989-01-01    All   2952994.0
24 1990-01-01    All   3364820.0
25 1991-01-01    All   3801698.0
26 1992-01-01    All   4177009.0
27 1993-01-01    All   4535687.0
28 1994-01-01    All   4800150.0
29 1995-01-01    All   4988665.0
30 1996-01-01    All   5323172.0
31 1997-01-01    All   5502388.0
32 1998-01-01    All   5614217.0
33 1999-01-01    All   5776091.0
34 2000-01-01    All   5662216.0
35 2001-01-01    All   5943439.0
36 2002-01-01    All   6405707.0
37 2003-01-01    All   6997964.0
38 2004-01-01    All   7596143.0
39 2005-01-01    All   8170413.0
40 2006-01-01    All   8680224.0
41 2007-01-01    All   9229172.0
42 2008-01-01    All  10699805.0
43 2009-01-01    All  12311349.0
44 2010-01-01    All  14025215.0
45 2011-01-01    All  15222940.0
46 2012-01-01    All  16432730.0
47 2013-01-01    All  17156119.0
48 2014-01-01    All  18141444.0
49 2015-01-01    All  18922179.0
50 2016-01-01    All  19976827.0
51 2017-01-01    All  20492747.0
52 2018-01-01    All  21974096.0
53 2019-01-01    All  23201380.0
54 2020-01-01    All  27747798.0
55 2021-01-01    All  29617215.0
56 2022-01-01    All  31419689.0
57 2023-01-01    All  34001494.0
58 2024-01-01    All  36218605.0

In [141]:
# Convert 'value_usd' column to full dollar value.
df_treasuries['value_usd'] = df_treasuries['value_usd'] * 1e6

In [143]:
df_treasuries

         year source     value_usd
0  1966-01-01    All  3.293190e+11
1  1967-01-01    All  3.446630e+11
2  1968-01-01    All  3.580290e+11
3  1969-01-01    All  3.682260e+11
4  1970-01-01    All  3.891580e+11
5  1971-01-01    All  4.241310e+11
6  1972-01-01    All  4.484730e+11
7  1973-01-01    All  4.690730e+11
8  1974-01-01    All  4.926640e+11
9  1975-01-01    All  5.766490e+11
10 1976-01-01    All  6.535430e+11
11 1977-01-01    All  7.189430e+11
12 1978-01-01    All  7.892070e+11
13 1979-01-01    All  8.451160e+11
14 1980-01-01    All  9.302100e+11
15 1981-01-01    All  1.028729e+12
16 1982-01-01    All  1.197074e+12
17 1983-01-01    All  1.410702e+12
18 1984-01-01    All  1.662966e+12
19 1985-01-01    All  1.945942e+12
20 1986-01-01    All  2.214835e+12
21 1987-01-01    All  2.431715e+12
22 1988-01-01    All  2.684392e+12
23 1989-01-01    All  2.952994e+12
24 1990-01-01    All  3.364820e+12
25 1991-01-01    All  3.801698e+12
26 1992-01-01    All  4.177009e+12
27 1993-01-01    All  4.535687e+12
28 1994-01-01    All  4.800150e+12
29 1995-01-01    All  4.988665e+12
30 1996-01-01    All  5.323172e+12
31 1997-01-01    All  5.502388e+12
32 1998-01-01    All  5.614217e+12
33 1999-01-01    All  5.776091e+12
34 2000-01-01    All  5.662216e+12
35 2001-01-01    All  5.943439e+12
36 2002-01-01    All  6.405707e+12
37 2003-01-01    All  6.997964e+12
38 2004-01-01    All  7.596143e+12
39 2005-01-01    All  8.170413e+12
40 2006-01-01    All  8.680224e+12
41 2007-01-01    All  9.229172e+12
42 2008-01-01    All  1.069980e+13
43 2009-01-01    All  1.231135e+13
44 2010-01-01    All  1.402522e+13
45 2011-01-01    All  1.522294e+13
46 2012-01-01    All  1.643273e+13
47 2013-01-01    All  1.715612e+13
48 2014-01-01    All  1.814144e+13
49 2015-01-01    All  1.892218e+13
50 2016-01-01    All  1.997683e+13
51 2017-01-01    All  2.049275e+13
52 2018-01-01    All  2.197410e+13
53 2019-01-01    All  2.320138e+13
54 2020-01-01    All  2.774780e+13
55 2021-01-01    All  2.961722e+13
56 2022-01-01    All  3.141969e+13
57 2023-01-01    All  3.400149e+13
58 2024-01-01    All  3.621860e+13

In [145]:
df_treasuries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 59 entries, 0 to 58
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       59 non-null     datetime64[ns]
 1   source     59 non-null     object
 2   value_usd  59 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 1.8+ KB

## Foreign + All

In [147]:
# Consolidate into foreign + all treasuries table
df_all_treasuries = pd.concat(objs = [df_foreign_treasuries, df_treasuries], ignore_index = True)

df_all_treasuries

          year   source     value_usd
0   1970-01-01  Foreign  1.970000e+10
1   1971-01-01  Foreign  4.600000e+10
2   1972-01-01  Foreign  5.440000e+10
3   1973-01-01  Foreign  5.470000e+10
4   1974-01-01  Foreign  5.880000e+10
..         ...      ...           ...
109 2020-01-01      All  2.774780e+13
110 2021-01-01      All  2.961722e+13
111 2022-01-01      All  3.141969e+13
112 2023-01-01      All  3.400149e+13
113 2024-01-01      All  3.621860e+13

[114 rows x 3 columns]

In [149]:
df_all_treasuries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114 entries, 0 to 113
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       114 non-null    datetime64[ns]
 1   source     114 non-null    object
 2   value_usd  114 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 2.8+ KB

In [151]:
# Comment out after creating CSV file
## Save consolidated public + private treasuries table as a CSV file
### df_all_treasuries.to_csv(path_or_buf = './silver_data/fred_treasuries_consolidated.csv', index = False)

# U.S. net savings

## Private sector

In [61]:
# Dollars in billions
df_private_savings = pd.read_csv('fred_private_savings.csv')
df_private_savings

   observation_date  W201RC1A027NBEA
0        1950-01-01           31.488
1        1951-01-01           42.049
2        1952-01-01           39.272
3        1953-01-01           38.481
4        1954-01-01           34.745
..              ...              ...
70       2020-01-01          274.318
71       2021-01-01          300.944
72       2022-01-01          430.830
73       2023-01-01          164.568
74       2024-01-01           35.774

[75 rows x 2 columns]

In [63]:
df_private_savings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   observation_date  75 non-null     object
 1   W201RC1A027NBEA   75 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.3+ KB

In [65]:
df_private_savings.describe()

       W201RC1A027NBEA
count        75.000000
mean        225.299813
std         205.506782
min        -373.532000
25%          79.892500
50%         187.793000
75%         320.364000
max         685.858000

In [67]:
# Rename columns using standardized format
new_private_columns = {'observation_date': 'year',
                       'W201RC1A027NBEA': 'value_usd'
                      }

df_private_savings = df_private_savings.rename(mapper = new_private_columns, axis = 1)

# Add a 'source' column
df_private_savings['source'] = 'Private sector'

# Reorder columns
df_private_savings = df_private_savings.reindex(columns = ['year', 'source', 'value_usd'])

# Convert 'year' column to date-time format
df_private_savings['year'] = pd.to_datetime(arg = df_private_savings['year'], yearfirst = True)

df_private_savings

         year          source  value_usd
0  1950-01-01  Private sector     31.488
1  1951-01-01  Private sector     42.049
2  1952-01-01  Private sector     39.272
3  1953-01-01  Private sector     38.481
4  1954-01-01  Private sector     34.745
..        ...             ...        ...
70 2020-01-01  Private sector    274.318
71 2021-01-01  Private sector    300.944
72 2022-01-01  Private sector    430.830
73 2023-01-01  Private sector    164.568
74 2024-01-01  Private sector     35.774

[75 rows x 3 columns]

In [69]:
# Show full dollar amounts for 'value_usd' column
df_private_savings['value_usd'] = df_private_savings['value_usd'] * 1e9

In [71]:
df_private_savings

         year          source     value_usd
0  1950-01-01  Private sector  3.148800e+10
1  1951-01-01  Private sector  4.204900e+10
2  1952-01-01  Private sector  3.927200e+10
3  1953-01-01  Private sector  3.848100e+10
4  1954-01-01  Private sector  3.474500e+10
..        ...             ...           ...
70 2020-01-01  Private sector  2.743180e+11
71 2021-01-01  Private sector  3.009440e+11
72 2022-01-01  Private sector  4.308300e+11
73 2023-01-01  Private sector  1.645680e+11
74 2024-01-01  Private sector  3.577400e+10

[75 rows x 3 columns]

In [73]:
df_private_savings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       75 non-null     datetime64[ns]
 1   source     75 non-null     object
 2   value_usd  75 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 1.9+ KB

## Public sector

In [75]:
# Dollars in billions
df_public_savings = pd.read_csv('fred_gov_budget.csv')
df_public_savings

   observation_date  A922RC1A027NBEA
0        1950-01-01            2.196
1        1951-01-01            6.101
2        1952-01-01           -0.242
3        1953-01-01           -1.830
4        1954-01-01           -5.956
..              ...              ...
70       2020-01-01        -2995.581
71       2021-01-01        -2618.368
72       2022-01-01         -936.224
73       2023-01-01        -1844.528
74       2024-01-01        -2053.168

[75 rows x 2 columns]

In [77]:
df_public_savings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   observation_date  75 non-null     object
 1   A922RC1A027NBEA   75 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.3+ KB

In [79]:
df_public_savings.describe()

       A922RC1A027NBEA
count        75.000000
mean       -419.763027
std         638.024658
min       -2995.581000
25%        -497.359000
50%        -171.256000
75%          -8.127500
max         118.211000

In [81]:
# Rename columns, add 'source' column, reorder columns, and convert 'year' column as datetime

# Rename columns using standardized format
new_public_columns = {'observation_date': 'year',
                       'A922RC1A027NBEA': 'value_usd'
                      }

df_public_savings = df_public_savings.rename(mapper = new_public_columns, axis = 1)

# Add 'source' column
df_public_savings['source'] = 'Public sector'

# Reorder columns
df_public_savings = df_public_savings.reindex(columns = ['year', 'source', 'value_usd'])

# Convert 'year' column to date-time format
df_public_savings['year'] = pd.to_datetime(arg = df_public_savings['year'], yearfirst = True)

df_public_savings

         year         source  value_usd
0  1950-01-01  Public sector      2.196
1  1951-01-01  Public sector      6.101
2  1952-01-01  Public sector     -0.242
3  1953-01-01  Public sector     -1.830
4  1954-01-01  Public sector     -5.956
..        ...            ...        ...
70 2020-01-01  Public sector  -2995.581
71 2021-01-01  Public sector  -2618.368
72 2022-01-01  Public sector   -936.224
73 2023-01-01  Public sector  -1844.528
74 2024-01-01  Public sector  -2053.168

[75 rows x 3 columns]

In [83]:
# Show 'value_usd' column in full dollar amounts
df_public_savings['value_usd'] = df_public_savings['value_usd'] * 1e9

In [85]:
df_public_savings

         year         source     value_usd
0  1950-01-01  Public sector  2.196000e+09
1  1951-01-01  Public sector  6.101000e+09
2  1952-01-01  Public sector -2.420000e+08
3  1953-01-01  Public sector -1.830000e+09
4  1954-01-01  Public sector -5.956000e+09
..        ...            ...           ...
70 2020-01-01  Public sector -2.995581e+12
71 2021-01-01  Public sector -2.618368e+12
72 2022-01-01  Public sector -9.362240e+11
73 2023-01-01  Public sector -1.844528e+12
74 2024-01-01  Public sector -2.053168e+12

[75 rows x 3 columns]

In [95]:
df_public_savings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       75 non-null     datetime64[ns]
 1   source     75 non-null     object
 2   value_usd  75 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 1.9+ KB

## Public + Private

In [87]:
# Vertically stack to create a consolidated public + private savings table
df_all_savings = pd.concat(objs = [df_public_savings, df_private_savings], ignore_index = True)
df_all_savings

          year          source     value_usd
0   1950-01-01   Public sector  2.196000e+09
1   1951-01-01   Public sector  6.101000e+09
2   1952-01-01   Public sector -2.420000e+08
3   1953-01-01   Public sector -1.830000e+09
4   1954-01-01   Public sector -5.956000e+09
..         ...             ...           ...
145 2020-01-01  Private sector  2.743180e+11
146 2021-01-01  Private sector  3.009440e+11
147 2022-01-01  Private sector  4.308300e+11
148 2023-01-01  Private sector  1.645680e+11
149 2024-01-01  Private sector  3.577400e+10

[150 rows x 3 columns]

In [95]:
# Check for duplicates
df_all_savings[df_all_savings.duplicated()]

Empty DataFrame
Columns: [year, source, value_usd]
Index: []

In [99]:
# Check for missing values
df_all_savings[df_all_savings.isna().any(axis = 1) == True]

Empty DataFrame
Columns: [year, source, value_usd]
Index: []

In [101]:
df_all_savings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       150 non-null    datetime64[ns]
 1   source     150 non-null    object
 2   value_usd  150 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 3.6+ KB

In [89]:
# Check current working directory
os.getcwd()

'C:\\Users\\eslee\\OneDrive\\Desktop\\Data Science\\portfolio\\SQL\\Data Cleaning'

In [91]:
# Comment out after creating CSV file
## Save consolidated public + private savings table as a CSV file
### df_all_savings.to_csv(path_or_buf = './silver_data/fred_savings_consolidated.csv', index = False)

# Government cost of debt comparison

## USA

In [13]:
# Yield in percent
df_usa_yield = pd.read_csv('fred_usa_yield.csv')
df_usa_yield

   observation_date  IRLTLT01USA156N
0        1954-01-01         2.401667
1        1955-01-01         2.816667
2        1956-01-01         3.182500
3        1957-01-01         3.647500
4        1958-01-01         3.315833
..              ...              ...
66       2020-01-01         0.894167
67       2021-01-01         1.442500
68       2022-01-01         2.951667
69       2023-01-01         3.957500
70       2024-01-01         4.208333

[71 rows x 2 columns]

## Germany

In [16]:
df_germany_yield = pd.read_csv('fred_germany_yield.csv')
df_germany_yield

   observation_date  IRLTLT01DEA156N
0        1957-01-01         7.516667
1        1958-01-01         6.783333
2        1959-01-01         5.766667
3        1960-01-01         6.425000
4        1961-01-01         5.875000
..              ...              ...
63       2020-01-01        -0.511024
64       2021-01-01        -0.373821
65       2022-01-01         1.142583
66       2023-01-01         2.434599
67       2024-01-01         2.321084

[68 rows x 2 columns]

## Greece

In [19]:
df_greece_yield = pd.read_csv('fred_greece_yield.csv')
df_greece_yield

   observation_date  IRLTLT01GRM156N
0        1998-01-01             8.48
1        1999-01-01             6.05
2        2000-01-01             6.11
3        2001-01-01             5.30
4        2002-01-01             5.12
5        2003-01-01             4.27
6        2004-01-01             4.26
7        2005-01-01             3.59
8        2006-01-01             4.07
9        2007-01-01             4.50
10       2008-01-01             4.80
11       2009-01-01             5.17
12       2010-01-01             9.09
13       2011-01-01            15.75
14       2012-01-01            22.50
15       2013-01-01            10.05
16       2014-01-01             6.93
17       2015-01-01             9.67
18       2016-01-01             8.36
19       2017-01-01             5.98
20       2018-01-01             4.19
21       2019-01-01             2.59
22       2020-01-01             1.27
23       2021-01-01             0.88
24       2022-01-01             3.49
25       2023-01-01             4.00
26       2024-01-01             3.35

## Japan

In [21]:
df_japan_yield = pd.read_csv('fred_japan_yield.csv')
df_japan_yield

   observation_date  IRLTLT01JPA156N
0        1989-01-01         5.127250
1        1990-01-01         6.959917
2        1991-01-01         6.336667
3        1992-01-01         5.326583
4        1993-01-01         4.320917
5        1994-01-01         4.363333
6        1995-01-01         3.443500
7        1996-01-01         3.101500
8        1997-01-01         2.373667
9        1998-01-01         1.541417
10       1999-01-01         1.749000
11       2000-01-01         1.744417
12       2001-01-01         1.319000
13       2002-01-01         1.263167
14       2003-01-01         1.003250
15       2004-01-01         1.492667
16       2005-01-01         1.354750
17       2006-01-01         1.740500
18       2007-01-01         1.665500
19       2008-01-01         1.467333
20       2009-01-01         1.333750
21       2010-01-01         1.148333
22       2011-01-01         1.102417
23       2012-01-01         0.835583
24       2013-01-01         0.689667
25       2014-01-01         0.520333
26       2015-01-01         0.350000
27       2016-01-01        -0.066250
28       2017-01-01         0.051667
29       2018-01-01         0.065000
30       2019-01-01        -0.110417
31       2020-01-01        -0.005417
32       2021-01-01         0.071667
33       2022-01-01         0.231667
34       2023-01-01         0.562500
35       2024-01-01         0.918333

## India

In [23]:
df_india_yield = pd.read_csv('fred_india_yield.csv')
df_india_yield

   observation_date  INDIRLTLT01STQ
0        2012-01-01        8.266667
1        2012-04-01        8.450000
2        2012-07-01        8.160000
3        2012-10-01        8.163333
4        2013-01-01        7.873333
5        2013-04-01        7.576667
6        2013-07-01        8.216667
7        2013-10-01        8.770000
8        2014-01-01        8.803333
9        2014-04-01        8.790000
10       2014-07-01        8.570000
11       2014-10-01        8.183333
12       2015-01-01        7.780000
13       2015-04-01        7.833333
14       2015-07-01        7.780000
15       2015-10-01        7.713333
16       2016-01-01        7.656667
17       2016-04-01        7.406667
18       2016-07-01        7.116667
19       2016-10-01        6.640000
20       2017-01-01        6.963333
21       2017-04-01        6.950000
22       2017-07-01        6.623333
23       2017-10-01        7.153333
24       2018-01-01        7.466667
25       2018-04-01        7.780000
26       2018-07-01        7.880000
27       2018-10-01        7.690000
28       2019-01-01        7.396667
29       2019-04-01        7.240000
30       2019-07-01        6.676667
31       2019-10-01        6.673333
32       2020-01-01        6.726667
33       2020-04-01        6.183333
34       2020-07-01        5.946667
35       2020-10-01        5.910000
36       2021-01-01        6.160000
37       2021-04-01        6.260000
38       2021-07-01        6.226667
39       2021-10-01        6.383333
40       2022-01-01        6.736667
41       2022-04-01        7.343333
42       2022-07-01        7.316667
43       2022-10-01        7.370000
44       2023-01-01        7.360000
45       2023-04-01        7.080000
46       2023-07-01        7.153333
47       2023-10-01        7.280000
48       2024-01-01        7.120000

## UK

In [26]:
df_uk_yield = pd.read_csv('fred_uk_yield.csv')
df_uk_yield

   observation_date  IRLTLT01GBA156N
0        1960-01-01         5.855833
1        1961-01-01         6.264167
2        1962-01-01         5.764167
3        1963-01-01         5.165833
4        1964-01-01         5.702500
..              ...              ...
60       2020-01-01         0.374442
61       2021-01-01         0.787608
62       2022-01-01         2.447292
63       2023-01-01         4.058300
64       2024-01-01         4.144242

[65 rows x 2 columns]

## France

In [29]:
df_france_yield = pd.read_csv('fred_france_yield.csv')
df_france_yield

   observation_date  IRLTLT01FRA156N
0        1960-01-01         5.663333
1        1961-01-01         5.519167
2        1962-01-01         5.434167
3        1963-01-01         5.338333
4        1964-01-01         5.449167
..              ...              ...
60       2020-01-01        -0.145000
61       2021-01-01         0.006667
62       2022-01-01         1.700833
63       2023-01-01         2.994167
64       2024-01-01         2.969167

[65 rows x 2 columns]

## Russia

In [32]:
df_russia_yield = pd.read_csv('fred_russia_yield.csv')
df_russia_yield

   observation_date  IRLTLT01RUA156N
0        1999-01-01        87.375833
1        2000-01-01        35.163333
2        2001-01-01        19.383333
3        2002-01-01        15.824167
4        2003-01-01         9.115000
5        2004-01-01         8.289167
6        2005-01-01         8.107500
7        2006-01-01         6.976667
8        2007-01-01         6.717500
9        2008-01-01         7.523333
10       2009-01-01         9.874167
11       2010-01-01         7.831667
12       2011-01-01         8.060833
13       2012-01-01         8.154167
14       2013-01-01         7.330833
15       2014-01-01         8.464167
16       2015-01-01        10.886667
17       2016-01-01        10.438333
18       2017-01-01         8.992500

## Spain

In [35]:
df_spain_yield = pd.read_csv('fred_spain_yield.csv')
df_spain_yield

   observation_date  IRLTLT01ESA156N
0        1980-01-01        15.960833
1        1981-01-01        15.811667
2        1982-01-01        15.987500
3        1983-01-01        16.909167
4        1984-01-01        16.522500
5        1985-01-01        13.367500
6        1986-01-01        11.354167
7        1987-01-01        12.813333
8        1988-01-01        11.744167
9        1989-01-01        13.600583
10       1990-01-01        14.677500
11       1991-01-01        12.360551
12       1992-01-01        11.695190
13       1993-01-01        10.210795
14       1994-01-01         9.997791
15       1995-01-01        11.270935
16       1996-01-01         8.736461
17       1997-01-01         6.401535
18       1998-01-01         4.832926
19       1999-01-01         4.727311
20       2000-01-01         5.525866
21       2001-01-01         5.115284
22       2002-01-01         4.957641
23       2003-01-01         4.123044
24       2004-01-01         4.104143
25       2005-01-01         3.386350
26       2006-01-01         3.784310
27       2007-01-01         4.306627
28       2008-01-01         4.363732
29       2009-01-01         3.974298
30       2010-01-01         4.250001
31       2011-01-01         5.436894
32       2012-01-01         5.846537
33       2013-01-01         4.561962
34       2014-01-01         2.721831
35       2015-01-01         1.735087
36       2016-01-01         1.393302
37       2017-01-01         1.557866
38       2018-01-01         1.419352
39       2019-01-01         0.661018
40       2020-01-01         0.379478
41       2021-01-01         0.348750
42       2022-01-01         2.198559
43       2023-01-01         3.486507
44       2024-01-01         3.153796

## Standard format

In [7]:
# Define function to automate dataframe format standardization
def country_yield_format(dataframe, country_name):
    new_column_names = {dataframe.columns[0]: 'year',
                        dataframe.columns[1]: '10y_yield'
                       }
    dataframe = dataframe.rename(mapper = new_column_names, axis = 1)
    dataframe['country'] = country_name
    dataframe = dataframe.reindex(columns = ['year', 'country', '10y_yield'])
    dataframe['year'] = pd.to_datetime(arg = dataframe['year'], yearfirst = True)
    dataframe['10y_yield'] = dataframe['10y_yield'] / 100 

    return dataframe

In [37]:
# Set up dictionary with country names as keys and 10y yield data as values
country_yield = {'USA': df_usa_yield,
                 'Germany': df_germany_yield,
                 'Greece': df_greece_yield,
                 'Japan': df_japan_yield,
                 'India': df_india_yield,
                 'UK': df_uk_yield,
                 'France': df_france_yield,
                 'Russia': df_russia_yield,
                 'Spain': df_spain_yield
                }

In [39]:
# Apply function to standardize dataframe format across all countries
country_yield_clean = {}

for key, value in country_yield.items():
    country_yield_clean[key] = country_yield_format(value, key)

In [41]:
country_yield_clean

{'USA':          year country  10y_yield
 0  1954-01-01     USA   0.024017
 1  1955-01-01     USA   0.028167
 2  1956-01-01     USA   0.031825
 3  1957-01-01     USA   0.036475
 4  1958-01-01     USA   0.033158
 ..        ...     ...        ...
 66 2020-01-01     USA   0.008942
 67 2021-01-01     USA   0.014425
 68 2022-01-01     USA   0.029517
 69 2023-01-01     USA   0.039575
 70 2024-01-01     USA   0.042083

 [71 rows x 3 columns],
 'Germany':          year  country  10y_yield
 0  1957-01-01  Germany   0.075167
 1  1958-01-01  Germany   0.067833
 2  1959-01-01  Germany   0.057667
 3  1960-01-01  Germany   0.064250
 4  1961-01-01  Germany   0.058750
 ..        ...      ...        ...
 63 2020-01-01  Germany  -0.005110
 64 2021-01-01  Germany  -0.003738
 65 2022-01-01  Germany   0.011426
 66 2023-01-01  Germany   0.024346
 67 2024-01-01  Germany   0.023211

 [68 rows x 3 columns],
 'Greece':          year country  10y_yield
 0  1998-01-01  Greece     0.0848
 1  1999-01-01  Greece     0.0605
 2  2000-01-01  Greece     0.0611
 3  2001-01-01  Greece     0.0530
 4  2002-01-01  Greece     0.0512
 5  2003-01-01  Greece     0.0427
 6  2004-01-01  Greece     0.0426
 7  2005-01-01  Greece     0.0359
 8  2006-01-01  Greece     0.0407
 9  2007-01-01  Greece     0.0450
 10 2008-01-01  Greece     0.0480
 11 2009-01-01  Greece     0.0517
 12 2010-01-01  Greece     0.0909
 13 2011-01-01  Greece     0.1575
 14 2012-01-01  Greece     0.2250
 15 2013-01-01  Greece     0.1005
 16 2014-01-01  Greece     0.0693
 17 2015-01-01  Greece     0.0967
 18 2016-01-01  Greece     0.0836
 19 2017-01-01  Greece     0.0598
 20 2018-01-01  Greece     0.0419
 21 2019-01-01  Greece     0.0259
 22 2020-01-01  Greece     0.0127
 23 2021-01-01  Greece     0.0088
 24 2022-01-01  Greece     0.0349
 25 2023-01-01  Greece     0.0400
 26 2024-01-01  Greece     0.0335,
 'Japan':          year country  10y_yield
 0  1989-01-01   Japan   0.051272
 1  1990-01-01   Japan   0.069599
 2  1991-01-01   Japan   0.063367
 3  1992-01-01   Japan   0.053266
 4  1993-01-01   Japan   0.043209
 5  1994-01-01   Japan   0.043633
 6  1995-01-01   Japan   0.034435
 7  1996-01-01   Japan   0.031015
 8  1997-01-01   Japan   0.023737
 9  1998-01-01   Japan   0.015414
 10 1999-01-01   Japan   0.017490
 11 2000-01-01   Japan   0.017444
 12 2001-01-01   Japan   0.013190
 13 2002-01-01   Japan   0.012632
 14 2003-01-01   Japan   0.010032
 15 2004-01-01   Japan   0.014927
 16 2005-01-01   Japan   0.013547
 17 2006-01-01   Japan   0.017405
 18 2007-01-01   Japan   0.016655
 19 2008-01-01   Japan   0.014673
 20 2009-01-01   Japan   0.013338
 21 2010-01-01   Japan   0.011483
 22 2011-01-01   Japan   0.011024
 23 2012-01-01   Japan   0.008356
 24 2013-01-01   Japan   0.006897
 25 2014-01-01   Japan   0.005203
 26 2015-01-01   Japan   0.003500
 27 2016-01-01   Japan  -0.000663
 28 2017-01-01   Japan   0.000517
 29 2018-01-01   Japan   0.000650
 30 2019-01-01   Japan  -0.001104
 31 2020-01-01   Japan  -0.000054
 32 2021-01-01   Japan   0.000717
 33 2022-01-01   Japan   0.002317
 34 2023-01-01   Japan   0.005625
 35 2024-01-01   Japan   0.009183,
 'India':          year country  10y_yield
 0  2012-01-01   India   0.082667
 1  2012-04-01   India   0.084500
 2  2012-07-01   India   0.081600
 3  2012-10-01   India   0.081633
 4  2013-01-01   India   0.078733
 5  2013-04-01   India   0.075767
 6  2013-07-01   India   0.082167
 7  2013-10-01   India   0.087700
 8  2014-01-01   India   0.088033
 9  2014-04-01   India   0.087900
 10 2014-07-01   India   0.085700
 11 2014-10-01   India   0.081833
 12 2015-01-01   India   0.077800
 13 2015-04-01   India   0.078333
 14 2015-07-01   India   0.077800
 15 2015-10-01   India   0.077133
 16 2016-01-01   India   0.076567
 17 2016-04-01   India   0.074067
 18 2016-07-01   India   0.071167
 19 2016-10-01   India   0.066400
 20 2017-01-01   India   0.069633
 21 2017-04-01   India   0.069500
 22 2017-07-01   India   0.066233
 23 2017-10-01   India   0.071533
 24 2018-01-01   India   0.074667
 25 2018-04-01   India   0.077800
 26 2018-07-01   India   0.078800
 27 2018-10-01   India   0.076900
 28 2019-01-01   India   0.073967
 29 2019-04-01   India   0.072400
 30 2019-07-01   India   0.066767
 31 2019-10-01   India   0.066733
 32 2020-01-01   India   0.067267
 33 2020-04-01   India   0.061833
 34 2020-07-01   India   0.059467
 35 2020-10-01   India   0.059100
 36 2021-01-01   India   0.061600
 37 2021-04-01   India   0.062600
 38 2021-07-01   India   0.062267
 39 2021-10-01   India   0.063833
 40 2022-01-01   India   0.067367
 41 2022-04-01   India   0.073433
 42 2022-07-01   India   0.073167
 43 2022-10-01   India   0.073700
 44 2023-01-01   India   0.073600
 45 2023-04-01   India   0.070800
 46 2023-07-01   India   0.071533
 47 2023-10-01   India   0.072800
 48 2024-01-01   India   0.071200,
 'UK':          year country  10y_yield
 0  1960-01-01      UK   0.058558
 1  1961-01-01      UK   0.062642
 2  1962-01-01      UK   0.057642
 3  1963-01-01      UK   0.051658
 4  1964-01-01      UK   0.057025
 ..        ...     ...        ...
 60 2020-01-01      UK   0.003744
 61 2021-01-01      UK   0.007876
 62 2022-01-01      UK   0.024473
 63 2023-01-01      UK   0.040583
 64 2024-01-01      UK   0.041442

 [65 rows x 3 columns],
 'France':          year country  10y_yield
 0  1960-01-01  France   0.056633
 1  1961-01-01  France   0.055192
 2  1962-01-01  France   0.054342
 3  1963-01-01  France   0.053383
 4  1964-01-01  France   0.054492
 ..        ...     ...        ...
 60 2020-01-01  France  -0.001450
 61 2021-01-01  France   0.000067
 62 2022-01-01  France   0.017008
 63 2023-01-01  France   0.029942
 64 2024-01-01  France   0.029692

 [65 rows x 3 columns],
 'Russia':          year country  10y_yield
 0  1999-01-01  Russia   0.873758
 1  2000-01-01  Russia   0.351633
 2  2001-01-01  Russia   0.193833
 3  2002-01-01  Russia   0.158242
 4  2003-01-01  Russia   0.091150
 5  2004-01-01  Russia   0.082892
 6  2005-01-01  Russia   0.081075
 7  2006-01-01  Russia   0.069767
 8  2007-01-01  Russia   0.067175
 9  2008-01-01  Russia   0.075233
 10 2009-01-01  Russia   0.098742
 11 2010-01-01  Russia   0.078317
 12 2011-01-01  Russia   0.080608
 13 2012-01-01  Russia   0.081542
 14 2013-01-01  Russia   0.073308
 15 2014-01-01  Russia   0.084642
 16 2015-01-01  Russia   0.108867
 17 2016-01-01  Russia   0.104383
 18 2017-01-01  Russia   0.089925,
 'Spain':          year country  10y_yield
 0  1980-01-01   Spain   0.159608
 1  1981-01-01   Spain   0.158117
 2  1982-01-01   Spain   0.159875
 3  1983-01-01   Spain   0.169092
 4  1984-01-01   Spain   0.165225
 5  1985-01-01   Spain   0.133675
 6  1986-01-01   Spain   0.113542
 7  1987-01-01   Spain   0.128133
 8  1988-01-01   Spain   0.117442
 9  1989-01-01   Spain   0.136006
 10 1990-01-01   Spain   0.146775
 11 1991-01-01   Spain   0.123606
 12 1992-01-01   Spain   0.116952
 13 1993-01-01   Spain   0.102108
 14 1994-01-01   Spain   0.099978
 15 1995-01-01   Spain   0.112709
 16 1996-01-01   Spain   0.087365
 17 1997-01-01   Spain   0.064015
 18 1998-01-01   Spain   0.048329
 19 1999-01-01   Spain   0.047273
 20 2000-01-01   Spain   0.055259
 21 2001-01-01   Spain   0.051153
 22 2002-01-01   Spain   0.049576
 23 2003-01-01   Spain   0.041230
 24 2004-01-01   Spain   0.041041
 25 2005-01-01   Spain   0.033863
 26 2006-01-01   Spain   0.037843
 27 2007-01-01   Spain   0.043066
 28 2008-01-01   Spain   0.043637
 29 2009-01-01   Spain   0.039743
 30 2010-01-01   Spain   0.042500
 31 2011-01-01   Spain   0.054369
 32 2012-01-01   Spain   0.058465
 33 2013-01-01   Spain   0.045620
 34 2014-01-01   Spain   0.027218
 35 2015-01-01   Spain   0.017351
 36 2016-01-01   Spain   0.013933
 37 2017-01-01   Spain   0.015579
 38 2018-01-01   Spain   0.014194
 39 2019-01-01   Spain   0.006610
 40 2020-01-01   Spain   0.003795
 41 2021-01-01   Spain   0.003488
 42 2022-01-01   Spain   0.021986
 43 2023-01-01   Spain   0.034865
 44 2024-01-01   Spain   0.031538}

## All countries

In [43]:
# Create consolidated 10y yield table across all countries
df_all_yield = pd.concat(country_yield_clean.values(), ignore_index = True)
df_all_yield

          year country  10y_yield
0   1954-01-01     USA   0.024017
1   1955-01-01     USA   0.028167
2   1956-01-01     USA   0.031825
3   1957-01-01     USA   0.036475
4   1958-01-01     USA   0.033158
..         ...     ...        ...
440 2020-01-01   Spain   0.003795
441 2021-01-01   Spain   0.003488
442 2022-01-01   Spain   0.021986
443 2023-01-01   Spain   0.034865
444 2024-01-01   Spain   0.031538

[445 rows x 3 columns]

In [45]:
# Check for duplicates
df_all_yield[df_all_yield.duplicated()]

Empty DataFrame
Columns: [year, country, 10y_yield]
Index: []

In [47]:
# Check for null values
df_all_yield[df_all_yield.isna().any(axis = 1)]

Empty DataFrame
Columns: [year, country, 10y_yield]
Index: []

In [49]:
df_all_yield.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       445 non-null    datetime64[ns]
 1   country    445 non-null    object
 2   10y_yield  445 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 10.6+ KB

In [51]:
# Comment out after creating CSV file
## Save consolidated 10y yield table across all countries as a CSV file
## df_all_yield.to_csv(path_or_buf = './silver_data/fred_yield_consolidated.csv', index = False)

# GDP by sector

In [3]:
df_sector = pd.read_csv(filepath_or_buffer = 'nea_gdp_sectors.csv', index_col = 0)
df_sector = df_sector.reset_index()
df_sector

,index,1950,1951,1952,1953,1954,1955,1956,1957,1958,...,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024
0,Gross domestic product,299.8,346.9,367.3,389.2,390.5,425.5,449.4,474.0,481.2,...,18295.0,18804.9,19612.1,20656.5,21540.0,21375.3,23725.6,26054.6,27811.5,29298.0
1,Manufacturing,80.3,95.8,100.0,109.5,103.7,117.3,122.4,127.5,120.9,...,2071.1,2035.2,2109.7,2261.8,2268.8,2156.8,2416.3,2668.2,2816.5,2880.7
2,"Finance, insurance, real estate, rental, and l...",33.8,37.7,41.3,45.5,49.2,53.3,56.9,60.9,65.3,...,3728.6,3894.7,4033.0,4258.2,4458.1,4633.8,5014.6,5455.1,5883.4,6281.6

In [4]:
df_sector = pd.melt(frame = df_sector, id_vars = 'index', var_name = 'year', value_name = 'value_usd' )
df_sector = df_sector.rename(mapper= {'index': 'sector'}, axis = 1)
df_sector

                                                sector  year  value_usd
0                               Gross domestic product  1950      299.8
1                                        Manufacturing  1950       80.3
2    Finance, insurance, real estate, rental, and l...  1950       33.8
3                               Gross domestic product  1951      346.9
4                                        Manufacturing  1951       95.8
..                                                 ...   ...        ...
220                                      Manufacturing  2023     2816.5
221  Finance, insurance, real estate, rental, and l...  2023     5883.4
222                             Gross domestic product  2024    29298.0
223                                      Manufacturing  2024     2880.7
224  Finance, insurance, real estate, rental, and l...  2024     6281.6

[225 rows x 3 columns]

In [5]:
df_sector.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225 entries, 0 to 224
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   sector     225 non-null    object
 1   year       225 non-null    object
 2   value_usd  225 non-null    float64
dtypes: float64(1), object(2)
memory usage: 5.4+ KB

In [6]:
# Comment out after creating clean long table
## df_sector.to_csv(path_or_buf = 'nea_gdp_sectors_clean.csv', index = False)

In [7]:
df_sector = df_sector.reindex(columns = ['year', 'sector', 'value_usd'])
df_sector['year'] = pd.to_datetime(arg = df_sector['year'], format = '%Y')
df_sector['value_usd'] = df_sector['value_usd'] * 1e9
df_sector

,year,sector,value_usd
0,1950-01-01,Gross domestic product,2.998000e+11
1,1950-01-01,Manufacturing,8.030000e+10
2,1950-01-01,"Finance, insurance, real estate, rental, and l...",3.380000e+10
3,1951-01-01,Gross domestic product,3.469000e+11
4,1951-01-01,Manufacturing,9.580000e+10
...,...,...,...
220,2023-01-01,Manufacturing,2.816500e+12
221,2023-01-01,"Finance, insurance, real estate, rental, and l...",5.883400e+12
222,2024-01-01,Gross domestic product,2.929800e+13
223,2024-01-01,Manufacturing,2.880700e+12
224,2024-01-01,"Finance, insurance, real estate, rental, and l...",6.281600e+12

In [8]:
df_sector['sector'].unique()

array(['Gross domestic product', 'Manufacturing',
       'Finance, insurance, real estate, rental, and leasing'],
      dtype=object)

In [9]:
sector_mapper = {'Gross domestic product': 'GDP',
                 'Finance, insurance, real estate, rental, and leasing': 'Financial'
                }

df_sector['sector'] = df_sector['sector'].replace(sector_mapper)

df_sector = df_sector.reindex(columns = ['year', 'sector', 'value_usd'])

df_sector

          year         sector     value_usd
0   1950-01-01            GDP  2.998000e+11
1   1950-01-01  Manufacturing  8.030000e+10
2   1950-01-01      Financial  3.380000e+10
3   1951-01-01            GDP  3.469000e+11
4   1951-01-01  Manufacturing  9.580000e+10
..         ...            ...           ...
220 2023-01-01  Manufacturing  2.816500e+12
221 2023-01-01      Financial  5.883400e+12
222 2024-01-01            GDP  2.929800e+13
223 2024-01-01  Manufacturing  2.880700e+12
224 2024-01-01      Financial  6.281600e+12

[225 rows x 3 columns]

In [10]:
# Check for duplicates
df_sector[df_sector.duplicated()]

Empty DataFrame
Columns: [year, sector, value_usd]
Index: []

In [11]:
df_sector.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 225 entries, 0 to 224
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       225 non-null    datetime64[ns]
 1   sector     225 non-null    object
 2   value_usd  225 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 5.4+ KB

In [24]:
# Comment out after creating CSV file
## Save clean GDP by sector table as a CSV file
### df_sector.to_csv(path_or_buf = './silver_data/nea_gdp_sector_clean.csv', index = False)